<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Lipp1</TITLE>
<META NAME="Versión" CONTENT="8.0.3514">
<META NAME="Fecha" CONTENT="05/12/96">
<META NAME="Template" CONTENT="C:\ARCHIVOS DE PROGRAMA\MICROSOFT OFFICE\OFFICE\html.dot">
<STYLE type="text/css"><!--         
A:LINK {COLOR:BLUE; TEXT-DECORATION:NONE}
A:VISITED {COLOR:GREY; TEXT-DECORATION:NONE}
A:HOVER {COLOR:RED; TEXT-DECORATION:UNDERLINE}
--></STYLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#FFFFFF">
<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
  <TR> 
    <TD WIDTH="46%" VALIGN="TOP"> 
      <P><A HREF="lipp.htm"><IMG SRC="left.gif" BORDER=0 WIDTH=36 HEIGHT=34></A>
    </TD>
    <TD WIDTH="11%" VALIGN="TOP"> 
      <P ALIGN="CENTER"><a href="lipp.htm"><img src="up.gif" border=0 width=34 height=36></a>
    </TD>
    <TD WIDTH="43%" VALIGN="TOP"> 
      <P ALIGN="RIGHT"><A HREF="lipp2.htm"><IMG SRC="right.gif" BORDER=0 WIDTH=36 HEIGHT=34></A>
    </TD>
  </TR>
</TABLE>
<P>&nbsp;</P>
<P ALIGN="CENTER"><font color="#000000"><b><u><font size="6">Cap&iacute;tulo 1</font></u></b></font></P>
<P> 
<HR>
<p><a name="indice"></a></P>
<dir> </dir>
<p><font color="#000000" size="3"><a href="#intro"><b><u>Introducci&oacute;n a 
  Linux</u></b> </a></font></p>
<dir> 
  <dir> 
    <p><font color="#000000"><a href="#1.1"><font size="2">1.1 Sobre este libro</font></a></font><font color="#000000" size="2"><br>
      <a href="#1.2">1.2 Breve historia de Linux</a><br>
      <a href="#1.3">1.3 Caracter&iacute;sticas del sistema</a><br>
      <a href="#1.4">1.4 Software </a></font></p>
    <dir> 
      <p><font color="#000000"><a href="#1.4.1"><font size="2">1.4.1 Comandos 
        y utilidades b&aacute;sicas</font></a></font><font color="#000000" size="2"><br>
        <a href="#1.4.2">1.4.2 Formateado y proceso de textos</a><br>
        <a href="#1.4.3">1.4.3 Lenguajes de programaci&oacute;n y utilidades</a><br>
        <a href="#1.4.4">1.4.4 El sistema X Window</a><br>
        <a href="#1.4.5">1.4.5 Redes</a><br>
        <a href="#1.4.6">1.4.6 Programas de comunicaciones y BBS</a><br>
        <a href="#1.4.7">1.4.7 Enlazando con MS-DOS</a><br>
        <a href="#1.4.8">1.4.8 Otras aplicaciones</a></font></p>
    </dir>
    <p><font color="#000000" size="2"><a href="#1.5">1.5 Acerca del Copyright</a><br>
      <a href="#1.6">1.6 Dise&ntilde;o y filosof&iacute;a de Linux</a></font></p>
    <dir> 
      <dir> 
        <p><font color="#000000"><a href="#1.6.1"><font size="2">1.6.1 Consejos 
          para novatos en UNIX</font></a></font><font color="#000000" size="2"><br>
          <a href="#1.6.2">1.6.2 Consejos para los gur&uacute;s</a></font></p>
      </dir>
    </dir>
    <p><font color="#000000"><a href="#1.7"><font size="2">1.7 Diferencias Entre 
      Linux y Otros Sistemas Operativos</font></a></font></p>
    <dir> 
      <dir> 
        <p><font color="#000000"><a href="#1.7.1"><font size="2">1.7.1 ¿Por qu&eacute; 
          usar Linux?</font></a></font><font color="#000000" size="2"><br>
          <a href="#1.7.2">1.7.2 Linux vs. MS-DOS</a><br>
          <a href="#1.7.3">1.7.3 Linux vs. Otros Sistemas Operativos</a><br>
          <a href="#1.7.4">1.7.4 Otras implementaciones de UNIX</a></font></p>
      </dir>
    </dir>
    <p><font color="#000000"><a href="#1.8"><font size="2">1.8 Requerimientos 
      de Hardware</font></a></font></p>
    <dir> 
      <dir> 
        <p><font color="#000000"><a href="#1.8.1"><font size="2">1.8.1 Requisitos 
          de Placa Base y de CPU</font></a></font><font color="#000000" size="2"><br>
          <a href="#1.8.2">1.8.2 Requisitos de memoria</a><br>
          <a href="#1.8.3">1.8.3 Requisitos de la controladora de disco duro</a><br>
          <a href="#1.8.4">1.8.4 Requisitos de espacio en disco</a><br>
          <a href="#1.8.5">1.8.5 Requisitos de monitor y adaptador de v&iacute;deo</a><br>
          <a href="#1.8.6">1.8.6 Hardware diverso</a><br>
          <a href="#1.8.7">1.8.7 Tarjetas Ethernet</a></font></p>
      </dir>
    </dir>
    <p><font color="#000000"><a href="#1.9"><font size="2">1.9 Fuentes de informaci&oacute;n 
      sobre Linux</font></a></font></p>
    <dir> 
      <dir> 
        <p><font color="#000000"><a href="#1.9.1"><font size="2">1.9.1 Documentaci&oacute;n 
          On-Line</font></a></font><font color="#000000" size="2"><br>
          <a href="#1.9.2">1.9.2 Linux en el WWW</a><br>
          <a href="#1.9.3">1.9.3 Libros y otras publicaciones</a><br>
          <a href="#1.9.4">1.9.4 Grupos de NEWS USENET</a><br>
          <a href="#1.9.5">1.9.5 Listas de correo en Internet</a></font></p>
      </dir>
    </dir>
    <p><font color="#000000"><a href="#1.10"><font size="2">1.10 Como obtener 
      ayuda</font></a></font></p>
  </dir>
</dir>
<p><font color="#000000"><b><u><font size="2"><a name="intro"></a><font size="3">Introducci&oacute;n 
  a Linux</font><font color="#000000" size="2"><br>
  </font></font></u></b><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000">Anterior- 
  <a href="#1.1">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font size="3"></font></font></u><b><u><font size="2"><font size="3"><br>
  <br>
  </font></font></u></b></font> 
<P><font color="#000000" size="2">Linux es probablemente el acontecimiento m&aacute;s 
  importante del software gratuito desde el original Space War, o, mas recientemente, 
  Emacs. Se ha convertido en el sistema operativo para los negocios, educaci&oacute;n, 
  y provecho personal. Linux ya no es solo para gur&uacute;s de UNIX que se sientan 
  durante horas frente a la resplandeciente consola (aunque le aseguramos que 
  un gran numero de usuarios pertenece a esta categor&iacute;a). Este libro le 
  ayudara a sacarle el m&aacute;ximo partido.<br>
  </font><font color="#000000" size="2">Linux (pronunciado con una i corta, como 
  en LIH-nucs) es un cl&oacute;nico del sistema operativo UNIX que corre en ordenadores 
  Intel 80386 y 80486. Soporta un amplio rango de software, desde TEX a X Windows 
  al compilador GNU C/C++ a TCP/IP. Es una implementaci&oacute;n de UNIX vers&aacute;til, 
  distribuida gratuitamente en los t&eacute;rminos de la Licencia GNU (vea el 
  Ap&eacute;ndice F).<br>
  </font><font color="#000000" size="2">Linux puede convertir cualquier PC 386 
  o 486 en una estaci&oacute;n de trabajo. Le pondr&aacute; todo el poder de UNIX 
  en la punta de sus dedos. En los negocios ya se instala Linux en redes enteras, 
  usando el sistema operativo para manejar registros financieros y de hospitales, 
  un entorno de usuario distribuido, telecomunicaciones, etc. Universidades de 
  todo el mundo usan Linux para dar cursos de programaci&oacute;n y dise&ntilde;o 
  de sistemas operativos. Y, por supuesto, entusiastas de los ordenadores de todo 
  el mundo est&aacute;n usando Linux en casa, para programar, entretenerse, y 
  conocerlo a fondo.<br>
  </font><font color="#000000" size="2">Lo que hace a Linux tan diferente es que 
  es una implementaci&oacute;n gratuita de UNIX. Fue y aun es desarrollado por 
  un grupo de voluntarios, principalmente en Internet, intercambiando c&oacute;digo, 
  comentando fallos, y arreglando los problemas en un entorno abierto. Cualquiera 
  es bienvenido a sumarse al esfuerzo de desarrollo de Linux: todo lo que se pide 
  es inter&eacute;s en producir un cl&oacute;nico gratuito de UNIX y algunos conocimientos 
  de programaci&oacute;n. El libro que tiene en sus manos es su gu&iacute;a de 
  viaje.<br>
  </font></P>
<p align="left"><font color="#000000"><b><u><font size="2"><a name="1.1"></a><font size="3">1.1 
  Sobre este libro: </font><br>
  </font></u></b><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#intro">Anterior</a>- 
  <a href="#1.2">Siguiente </a>- <a href="#indice">&Iacute;ndice</a> </font></font></u></font></font></u></font></font></u></font><font size="2"> 
  <font size="3"></font></font></u><b><u><font size="2"><font size="3"><br>
  </font></font></u></b></font></p>
<P><font color="#000000" size="2">Este libro es una gu&iacute;a de instalaci&oacute;n 
  e iniciaci&oacute;n al sistema Linux. El objetivo es conseguir que los nuevos 
  usuarios se adapten y hagan funcionar el sistema, condensando tanto material 
  importante como sea posible dentro de un libro. En lugar de abarcar muchos de 
  los vol&aacute;tiles detalles t&eacute;cnicos, esas cosas que tienden a cambiar 
  con el veloz desarrollo, le ofrecemos una base suficiente con la que podr&aacute; 
  buscar mas por Ud. mismo.<br>
  </font><font color="#000000" size="2">Linux no es dif&iacute;cil de instalar 
  y usar. Sin embargo, como cualquier implementaci&oacute;n de UNIX, a menudo 
  hay algo de magia negra implicada para conseguir que todo funcione correctamente.<br>
  </font><font color="#000000" size="2">Esperamos que este libro le introduzca 
  en el mundo del Linux y le muestre cuan atractivo puede llegar a ser este sistema 
  operativo.<br>
  </font><font color="#000000" size="2">En este libro se tratan los 
  siguientes temas.</font></P>
<P><font size="2" color="#000000"><B>o</b> ¿Qu&eacute; es Linux? El dise&ntilde;o 
  y la filosof&iacute;a de este sistema operativo &uacute;nico, y lo que puede 
  hacer por Ud.<br>
  </font><font size="2" color="#000000"><B>o</b> Todos los detalles de lo que 
  es necesario para correr Linux, incluyendo sugerencias sobre que tipo de configuraci&oacute;n 
  hardware se recomienda para un sistema completo.<br>
  </font><font size="2" color="#000000"><B>o</b> Como obtener e instalar Linux. 
  Hay muchas distribuciones del software de Linux. Presentamos una discusi&oacute;n 
  general de las distribuciones de software de Linux, como obtenerlas, e instrucciones 
  gen&eacute;ricas para instalar el software (que deber&iacute;an ser aplicables 
  a cualquier distribuci&oacute;n). Esta edici&oacute;n tambi&eacute;n contiene 
  instrucciones especificas para la distribuci&oacute;n Slackware de Linux.<br>
  </font><font size="2" color="#000000"><B>o</b> Un breve tutorial de introducci&oacute;n 
  a UNIX, para aquellos usuarios que nunca antes hayan tenido contacto con UNIX. 
  Este tutorial deber&iacute;a proporcionar, esperamos, material suficiente para 
  que completos novatos consigan los conocimientos b&aacute;sicos de como moverse 
  por el sistema.<br>
  </font><font size="2" color="#000000"><B>o</b> Una introducci&oacute;n a la 
  administraci&oacute;n de sistemas con Linux. Esto abarca las tareas m&aacute;s 
  importantes con las que los nuevos administradores de Linux necesitaran familiarizarse, 
  tales como crear usuarios, manejar los sistemas de ficheros, y muchas m&aacute;s.<br>
  </font><font size="2" color="#000000"><B>o</b> Informaci&oacute;n sobre configuraci&oacute;n 
  de aspectos mas avanzados de Linux, como el Sistema X-Window, redes con TCP/IP 
  y SLIP, y la puesta en marcha del correo electr&oacute;nico y sistemas de news.<br>
  </font><font color="#000000" size="2">Este 
  libro es para el usuario de ordenador personal que desea iniciarse en Linux. 
  No se asume experiencia previa de UNIX, pero se espera que los novatos busquen 
  mas materiales sobre la marcha.<br>
  </font><font color="#000000" size="2">Para los no familiarizados con UNIX, se 
  da una lista de fuentes de informaci&oacute;n &uacute;tiles en el Ap&eacute;ndice 
  A.<br>
  </font><font color="#000000" size="2">En general, se pretende que este libro 
  se lea junto con otro libro sobre conceptos b&aacute;sicos de UNIX.</font></P>
<P><font color="#000000"><b><u><font size="2"><a name="1.2"></a><font size="3">1.2 
  Breve historia de Linux: </font><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.1">Anterior</a>- 
  <a href="#1.3">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000" size="2"> 
  </font></font></u></b></font></font></u></b></font></font></u></b></font></font></u></b></font></u></b></font></font></u></b></font></P>
<P><font color="#000000" size="2">UNIX es uno de los sistemas operativos m&aacute;s 
  populares del mundo debido a su extenso soporte y distribuci&oacute;n. Originalmente 
  fue desarrollado como sistema multitarea con tiempo compartido para miniordenadores 
  y mainframes a mediados de los 70, y desde entonces se ha convertido en uno 
  de los sistemas mas utilizados a pesar de su, ocasionalmente, confusa interfaz 
  con el usuario y el problema de su estandarizaci&oacute;n.<br>
  </font><font color="#000000" size="2">¿Cu&aacute;l es la verdadera raz&oacute;n 
  de la popularidad de UNIX? Muchos hackers consideran que UNIX es el autentico 
  y &uacute;nico sistema operativo. El desarrollo de Linux parte de un grupo en 
  expansi&oacute;n de hackers de UNIX que quisieron hacer su sistema con sus propias 
  manos.<br>
  </font><font color="#000000" size="2">Existen numerosas versiones de UNIX para 
  muchos sistemas, desde ordenadores personales hasta supercomputadores como el 
  Cray Y-MP. La mayor&iacute;a de las versiones de UNIX para ordenadores personales 
  son muy caras. Cuando se escrib&iacute;a este libro, una copia para una maquina 
  386 del UNIX System V de AT&amp;T costaba unos 1500 d&oacute;lares estadounidenses.<br>
  </font><font size="2" color="#000000">Linux es una versi&oacute;n de UNIX de 
  libre distribuci&oacute;n, inicialmente desarrollada por Linus Torvalds (</font><font color="#000000"><A HREF="mailto:torvalds@kruuna.helsinki.fi"><B>torvalds@kruuna.helsinki.fi</B></A><FONT SIZE=2>) 
  en la Universidad de Helsinki, en Finlandia. Fue desarrollado con la ayuda de 
  muchos programadores y expertos de Unix a lo largo y ancho del mundo, gracias 
  a la presencia de Internet. Cualquier habitante del planeta puede acceder a 
  Linux y desarrollar nuevos m&oacute;dulos o cambiarlo a su antojo.<br>
  </font></font><font color="#000000" size="2">El n&uacute;cleo de Linux no utiliza 
  ni una sola l&iacute;nea del c&oacute;digo de AT&amp;T o de cualquier otra fuente 
  de propiedad comercial, y buena parte del software para Linux se desarrolla 
  bajo las reglas del proyecto de GNU de la Free Software Foundation, Cambridge, 
  Massachusetts.<br>
  </font><font color="#000000" size="2">Inicialmente, solo fue un proyecto de 
  aficionado de Linus Torvalds. Se inspiraba en Minix, un peque&ntilde;o UNIX 
  desarrollado por Andy Tanenbaum, y las primeras discusiones sobre Linux surgieron 
  en el grupo de News comp.os.minix. Estas discusiones giraban en torno al desarrollo 
  de un peque&ntilde;o sistema UNIX de car&aacute;cter acad&eacute;mico dirigido 
  a aquellos usuarios de Minix que quer&iacute;an algo mas.<br>
  </font><font color="#000000" size="2">El desarrollo inicial de Linux ya aprovechaba 
  las caracter&iacute;sticas de conmutaci&oacute;n de tareas en modo protegido 
  del 386, y se escribi&oacute; todo en ensamblador. Linus dice, "Comenc&eacute; 
  a utilizar el C tras escribir algunos drivers, y ciertamente se acelero el desarrollo. 
  En este punto sent&iacute; que mi idea de hacer un `un Minix mejor que Minix' 
  se hacia mas seria. Esperaba que alg&uacute;n d&iacute;a pudiese recompilar 
  el gcc bajo Linux. . .<br>
  </font><font color="#000000" size="2">"Dos meses de trabajo, hasta que tuve 
  un driver de discos (con numerosos bugs, pero que parec&iacute;a funcionar en 
  mi PC) y un peque&ntilde;o sistema de ficheros. Aqu&iacute; tenia ya la versi&oacute;n 
  0.01 [al final de Agosto de 1991]: no era muy agradable de usar sin el driver 
  de disquetes, y no hacia gran cosa. No pense que alguien compilar&iacute;a esa 
  versi&oacute;n."<br>
  </font><font color="#000000" size="2">No se anuncio nada sobre esa versi&oacute;n, 
  puesto que las fuentes del 0.01 jamas fueron ejecutables: conten&iacute;an solo 
  rudimentos de lo que seria el n&uacute;cleo, y se asum&iacute;a que se tenia 
  acceso a un Minix para poderlo compilar y jugar con el.<br>
  </font><font color="#000000" size="2">El 5 de Octubre de 1991, Linus anuncio 
  la primera versi&oacute;n "oficial" de Linux, la 0.02. Ya pod&iacute;a ejecutar 
  bash (el shell de GNU) y gcc (el compilador de C de GNU), pero no hacia mucho 
  mas. La intenci&oacute;n era ser un juguete para hackers. No hab&iacute;a nada 
  sobre soporte a usuarios, distribuciones, documentaci&oacute;n ni nada parecido. 
  Hoy, la comunidad de Linux aun trata estos asuntos de forma secundaria. Lo primero 
  sigue siendo el desarrollo del kernel.<br>
  </font><font color="#000000" size="2">Linus escrib&iacute;a en comp.os.minix, 
  "¿Suspir&aacute;is al recordar aquellos d&iacute;as de Minix-1.1, cuando los 
  hombres eran hombres y escrib&iacute;an sus propios drivers? ¿Os sent&iacute;s 
  sin ning&uacute;n proyecto interesante y os gustar&iacute;a tener un verdadero 
  S.O. que pudierais modificar a placer? ¿Os resulta frustrante el tener solo 
  a Minix? Entonces, este articulo es para vosotros.<br>
  </font><font color="#000000" size="2">"Como dije hace un mes, estoy trabajando 
  en una versi&oacute;n gratuita de algo parecido a Minix para ordenadores At-386. 
  He alcanzado la etapa en la que puede ser utilizable y voy a poner las fuentes 
  para su distribuci&oacute;n. Es solo la versi&oacute;n 0.02. . . pero he conseguido 
  ejecutar en el bash, gcc, gnu-make, gnu-sed, compress, etc.<br>
  </font><font color="#000000" size="2">Tras la versi&oacute;n 0.03, Linus salto 
  a la versi&oacute;n 0.10, al tiempo que mas gente empezaba a participar en su 
  desarrollo. Tras numerosas revisiones, se alcanzo la versi&oacute;n 0.95, reflejando 
  la esperanza de tener lista muy pronto una versi&oacute;n "oficial". (Generalmente, 
  la versi&oacute;n 1.0 de los programas se corresponden con la primera te&oacute;ricamente 
  completa y sin errores). Esto suced&iacute;a en Marzo de 1992. A&ntilde;o y 
  medio despu&eacute;s, en Diciembre del 93, el n&uacute;cleo estaba en la revisi&oacute;n 
  0.99.pl14, en una aproximaci&oacute;n asint&oacute;tica al 1.0. Actualmente, 
  el n&uacute;cleo se encuentra en la versi&oacute;n 1.1 parche 52, y se acerca 
  la 1.2.2<br>
  </font><font color="#000000" size="2">Hoy Linux es ya un cl&oacute;nico de UNIX 
  completo, capaz de ejecutar X Window, TCP/IP, Emacs, UUCP y software de correo 
  y News. Mucho software de libre distribuci&oacute;n ha sido ya portado a Linux, 
  y est&aacute;n empezando a aparecer aplicaciones comerciales. El hardware soportado 
  es mucho mayor que en las primeras versiones del n&uacute;cleo. Mucha gente 
  ha ejecutado tests de rendimiento en sus sistemas Linux 486 y se han encontrado 
  que son comparables a las estaciones de trabajo de gama media de Sun Microsystems 
  y Digital. ¿Qui&eacute;n iba a imaginar que este "peque&ntilde;o" cl&oacute;nico 
  de UNIX iba a convertirse en un est&aacute;ndar mundial para los ordenadores 
  personales?</font></P>
<P><font color="#000000"><b><u><font size="2"><a name="1.3"></a><font size="3">1.3 
  Caracter&iacute;sticas del sistema: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.2">Anterior</a>- 
  <a href="#1.4">Siguiente </a>- <a href="#indice">&Iacute;ndice</a> </font></font></u></font></font></u></font></font></u></font></font></u></font></font></u></font><font size="2"></font></u></font></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b></font></P>
<P><font color="#000000" size="2">Linux implementa la mayor parte de las caracter&iacute;sticas 
  que se encuentran en otras implementaciones de UNIX, mas algunas otras que no 
  son habituales. En esta secci&oacute;n nos daremos una vuelta por todo ello.<br>
  </font><font color="#000000" size="2">Linux es un sistema operativo completo 
  con multitarea y multiusuario (como cualquier otra versi&oacute;n de UNIX). 
  Esto significa que pueden trabajar varios usuarios simult&aacute;neamente en 
  el, y que cada uno de ellos puede tener varios programas en ejecuci&oacute;n.<br>
  </font><font color="#000000" size="2">El sistema Linux es compatible con ciertos 
  est&aacute;ndares de UNIX a nivel de c&oacute;digo fuente, incluyendo el IEEE 
  POSIX.1, System V y BSD. Fue desarrollado buscando la portabilidad de los fuentes: 
  encontrara que casi todo el software gratuito desarrollado para UNIX se compila 
  en Linux sin problemas. Y todo lo que se hace para Linux (c&oacute;digo del 
  n&uacute;cleo, drivers, librer&iacute;as y programas de usuario) es de libre 
  distribuci&oacute;n.<br>
  </font><font color="#000000" size="2">En Linux tambi&eacute;n 
  se implementa el control de trabajos POSIX (que se usa en los shells csh y bash), 
  las pseudoterminales (dispositivos pty), y teclados nacionales mediante manejadores 
  de teclado cargables din&aacute;micamente. Adem&aacute;s, soporta consolas virtuales, 
  lo que permite tener mas de una sesi&oacute;n abierta en la consola de texto 
  y conmutar entre ellas f&aacute;cilmente. A los usuarios del programa "screen" 
  les resultara familiar esto.</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">2 N. del T.: En el momento de traducir estas 
  l&iacute;neas la versi&oacute;n estable del n&uacute;cleo es la 1.2.13, pero 
  el desarrollo continua por la 1.3.47 en versi&oacute;n beta . . .</font></P>
<P><font color="#000000" size="2">El n&uacute;cleo es capaz de emular por su cuenta 
  las instrucciones del coprocesador 387, con lo que en cualquier 386 con coprocesador 
  o sin el se podr&aacute;n ejecutar aplicaciones que lo requieran.<br>
  </font><font color="#000000" size="2">Linux soporta diversos sistemas de ficheros 
  para guardar los datos. Algunos de ellos, como el ext2fs, han sido desarrollados 
  espec&iacute;ficamente para Linux. Otros sistemas de ficheros, como el Minix-1 
  o el de Xenix tambi&eacute;n est&aacute;n soportados. Y con el de MS-DOS se 
  podr&aacute;n acceder desde Linux a los disquetes y particiones en discos duros 
  formateados con MS-DOS. Adem&aacute;s, tambi&eacute;n soporta el ISO-9660, que 
  es el est&aacute;ndar seguido en el formato de los CD-ROMs. Hablaremos mas sobre 
  los sistemas de ficheros en los cap&iacute;tulos 2 y 4.<br>
  </font><font color="#000000" size="2">Linux implementa todo lo necesario para 
  trabajar en red con TCP/IP. Desde manejadores para las tarjetas de red mas populares 
  hasta SLIP/PPP, que permiten acceder a una red TCP/IP por el puerto serie. Tambi&eacute;n 
  se implementan PLIP (para comunicarse por el puerto de la impresora) y NFS (para 
  acceso remoto a ficheros). Y tambi&eacute;n se han portado los clientes de TCP/IP, 
  como FTP, telnet, NNTP y SMTP. Hablaremos mas acerca de esto en el capitulo 
  5.<br>
  </font><font color="#000000" size="2">El n&uacute;cleo de Linux ha sido desarrollado 
  para utilizar las caracter&iacute;sticas del modo protegido de los microprocesadores 
  80386 y 80486. En concreto, hace uso de la gesti&oacute;n de memoria avanzada 
  del modo protegido y otras caracter&iacute;sticas avanzadas. Cualquiera que 
  conozca la programaci&oacute;n del 386 en el modo protegido sabr&aacute; que 
  este modo fue dise&ntilde;ado para su uso en UNIX (o tal vez Multics). Linux 
  hace uso de esta funcionalidad precisamente.<br>
  </font><font color="#000000" size="2">El n&uacute;cleo soporta ejecutables con 
  paginaci&oacute;n por demanda. Esto significa que solo los segmentos del programa 
  que se necesitan se cargan en memoria desde el disco. Las paginas de los ejecutables 
  son compartidas mediante la t&eacute;cnica copy-on-write, contribuyendo todo 
  ello a reducir la cantidad de memoria requerida para las aplicaciones.<br>
  </font><font color="#000000" size="2">Con el fin de incrementar la memoria disponible, 
  Linux implementa la paginaci&oacute;n con el disco: puede tener hasta 256 megabytes 
  de espacio de intercambio o "swap"3 en el disco duro. Cuando el sistema necesita 
  mas memoria, expulsara paginas inactivas al disco, permitiendo la ejecuci&oacute;n 
  de programas mas grandes o aumentando el numero de usuarios que puede atender 
  a la vez. Sin embargo, el espacio de intercambio no puede suplir totalmente 
  a la memoria RAM, ya que el primero es mucho mas lento que esta.<br>
  </font><font color="#000000" size="2">La memoria dedicada a los programas y 
  a la cache de disco esta unificada. Por ello, si en cierto momento hay mucha 
  memoria libre, el tama&ntilde;o de la cache de disco aumentara acelerando as&iacute; 
  los accesos.<br>
  </font><font color="#000000" size="2">Los ejecutables hacen uso 
  de las librer&iacute;as de enlace din&aacute;mico. Esto significa que los ejecutables 
  comparten el c&oacute;digo com&uacute;n de las librer&iacute;as en un &uacute;nico 
  fichero, como sucede en SunOS. As&iacute;, los ejecutables ser&aacute;n mas 
  cortos a la hora de guardarlos en el disco, incluyendo aquellos que hagan uso 
  de muchas funciones de librer&iacute;a. Tambi&eacute;n pueden enlazarse est&aacute;ticamente 
  cuando se deseen ejecutables que no requieran la presencia de las librer&iacute;as 
  din&aacute;micas en el sistema. El enlace din&aacute;mico se hace en tiempo 
  de ejecuci&oacute;n, con lo que el programador puede cambiar las librer&iacute;as 
  sin necesidad de recompilaci&oacute;n de los ejecutables. Para facilitar la 
  depuraci&oacute;n de los programas, el n&uacute;cleo de Linux puede generar 
  volcados de</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">3 El nombre swap es inadecuado: no se intercambian 
  procesos completos, sino paginas individuales. Por supuesto, en muchos casos 
  se expulsan al disco procesos completos, pero no siempre ocurre la imagen de 
  memoria de los programas (ficheros core). Entre esto y la posibilidad de compilar 
  ejecutables con soporte de depuraci&oacute;n, el programador podr&aacute; averiguar 
  la causa de los fallos de su programa.</font></P>
<P><font color="#000000"><b><u><font size="2"><a name="1.4"></a><font size="3">1.4 
  Software: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.3">Anterior</a>- 
  <a href="#1.4.1">Siguiente </a>- <a href="#indice">&Iacute;ndice</a> </font></font></u></font></font></u></font></font></u></font></font></u></font></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b></font></font></u></b></font></P>
<P><font color="#000000" size="2">En esta secci&oacute;n le haremos una breve 
  introducci&oacute;n sobre las muchas aplicaciones software disponibles para 
  Linux y sobre tareas t&iacute;picas con ordenadores. Despu&eacute;s de todo 
  la parte mas importante del sistema radica en la cantidad de software disponible 
  que existe. El hecho de que la mayor parte de ese software sea gratis lo hace 
  aun mas impresionante.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.4.1"></a>1.4.1 Comandos 
  y utilidades b&aacute;sicas: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.4">Anterior</a>- 
  <a href="#1.4.2">Siguiente </a>- <a href="#indice">&Iacute;ndice</a> </font></font></u></font></font></u></font></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">Pr&aacute;cticamente cada utilidad que espere 
  encontrar en un sistema UNIX est&aacute;ndar ha sido trasladada a Linux. Esto 
  incluye comandos b&aacute;sicos como ls, awk, tr, sed, bc, more, y muchos mas. 
  Diga el nombre de una. Es seguro que Linux la tiene. En Linux puede esperar 
  encontrar un entorno de trabajo que le ser&aacute; familiar si procede de entornos 
  UNIX. Todos los comandos est&aacute;ndar y utilidades est&aacute;n ah&iacute;. 
  (Los usuarios novatos de Linux deber&iacute;an ver el Capitulo 3 para una introducci&oacute;n 
  a los comandos b&aacute;sicos del UNIX.)<br>
  </font><font color="#000000" size="2">Hay disponibles numerosos editores de 
  texto, incluyendo vi, ex, pico, jove, GNU Emacs y sus variantes como Lucid Emacs 
  (el cual incorpora extensiones para usarlo bajo X Window), y joe. Sea cual sea 
  el editor que este acostumbrado a usar, es pr&aacute;cticamente seguro que habr&aacute; 
  sido portado a Linux.<br>
  </font><font color="#000000" size="2">La elecci&oacute;n de un editor de texto 
  es un asunto interesante. Muchos usuarios de UNIX siguen usando editores "simples", 
  como vi (de hecho, el autor escribi&oacute; este libro usando vi sobre Linux.<br>
  </font><font color="#000000" size="2">Pero vi tiene muchas limitaciones debido 
  a su antig&uuml;edad, por lo que est&aacute;n ganando popularidad editores mas 
  modernos (y complejos) como Emacs. Emacs proporciona un completo lenguaje de 
  macros basadas en LISP con su interprete, una poderosa sintaxis de &oacute;rdenes 
  y multitud de otras opciones interesantes. Existe un conjunto de macros de Emacs 
  para leer correo electr&oacute;nico y 'news', moverse por el &aacute;rbol de 
  directorios, e incluso tener una sesi&oacute;n de psicoterapia con un psicoterapeuta 
  de inteligencia artificial (indispensable para Linuxeros estresados :-))<br>
  </font><font color="#000000" size="2">Un punto interesante es que la mayor&iacute;a 
  de las utilidades b&aacute;sicas para Linux son programas GNU. Estas utilidades 
  GNU proporcionan caracter&iacute;sticas avanzadas que no se encuentran en las 
  versiones est&aacute;ndar para BSDo AT&amp;T. Por ejemplo, la versi&oacute;n 
  de GNU del editor vi, elvis, incluye un lenguaje de macros estructurado que 
  difiere de la versi&oacute;n inicial de AT&amp;T. De cualquier modo, las utilidades 
  GNU se esfuerzan por mantenerse compatibles con sus equivalentes BSD y System 
  V.<br>
  </font><font color="#000000" size="2">Mucha gente considera las versiones GNU 
  de estos programas superiores a las originales. La utilidad mas importante para 
  la mayor&iacute;a de los usuarios es el interprete de comandos. El interprete 
  de comandos es un programa que lee y ejecuta &oacute;rdenes del usuario. Adem&aacute;s, 
  muchas proporcionan caracter&iacute;sticas como control de procesos (permitiendo 
  al usuario manejar varios procesos corriendo a la vez), redirecci&oacute;n de 
  entrada/salida, y un lenguaje de &oacute;rdenes para escribir scripts. Una script 
  es un fichero que contiene un programa en el lenguaje de &oacute;rdenes del 
  interprete de comandos, similar a los ficheros "batch" de MS-DOS.<br>
  </font><font color="#000000" size="2">Hay varios tipos de interpretes de comandos 
  disponibles para Linux. La principal diferencia entre ellos es el lenguaje de 
  comandos. Por ejemplo, el C Shell (csh) usa un lenguaje de comandos muy parecido 
  al lenguaje de programaci&oacute;n C. El cl&aacute;sico Bourne Shell usa un 
  lenguaje de comandos diferente. Un argumento para la elecci&oacute;n de un determinado 
  interprete de comandos es el lenguaje de comandos que proporciona. El interprete 
  de comandos que use, definir&aacute; su entorno de trabajo bajo Linux.<br>
  </font><font color="#000000" size="2">No importa el interprete de comandos que 
  este acostumbrado a usar, alguna versi&oacute;n de este habr&aacute; sido probablemente 
  llevada a Linux. La mas popular es el GNU Bourne Again Shell (bash), que es 
  una variante del Bourne cl&aacute;sico que incluye muchas caracter&iacute;sticas 
  avanzadas como control de procesos, historial de &oacute;rdenes, terminaci&oacute;n 
  de comandos y ficheros, edici&oacute;n de la l&iacute;nea de comandos al estilo 
  Emacs y poderosas extensiones al lenguaje de comandos del Bourne cl&aacute;sico. 
  Otro interprete de comandos muy popular es el tcsh, una versi&oacute;n del C 
  Shell con funcionalidad avanzada similar a la encontrada en bash. Otros interpretes 
  de comandos son zsh, un peque&ntilde;o interprete similar al Bourne; el Korn 
  (ksh); BSD's ash y rc, el interprete de comandos de Plan 9.<br>
  </font><font color="#000000" size="2">Linux le da la oportunidad &uacute;nica 
  de configurar el sistema a su gusto seg&uacute;n sus necesidades. Por ejemplo, 
  si usted es la &uacute;nica persona que usa el sistema, y prefiere el editor 
  vi, y el interprete de comandos bash, no es necesario que instale otros editores 
  e interpretes de comandos. La actitud "h&aacute;gaselo usted mismo" es la que 
  se impone entre los usuarios de Linux.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.4.2"></a>1.4.2 Formateado 
  y proceso de textos: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.4.1">Anterior</a>- 
  <a href="#1.4.3">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font><font color="#000000" size="2"></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000" size="2"> 
  </font></font></u></b></font></font></u></b></font></font></u></b></font></font></u></b></font></u></font><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">Casi la totalidad de los usuarios de ordenadores 
  tiene la necesidad de usar un sistema de preparaci&oacute;n de documentos de 
  alg&uacute;n tipo. (¿Cuantos entusiastas de los ordenadores conoces que todav&iacute;a 
  usen papel y l&aacute;piz?. No demasiados, apostamos por ello). En el mundo 
  de los PC, procesado de textos es la norma: esto implica edici&oacute;n y manipulaci&oacute;n 
  de texto (a menudo en un entorno WYSIWYG 4 y la producci&oacute;n de copias 
  impresas del texto con dibujos, tablas y otros adornos.<br>
  </font><font color="#000000" size="2">En el mundo UNIX, el formateado de textos 
  es mucho mas com&uacute;n. Es bastante diferente del cl&aacute;sico concepto 
  de proceso de textos. Con un sistema de formateado de textos, el texto es introducido 
  por el autor usando un "lenguaje de composici&oacute;n", que describe como debe 
  ser formateado el texto. En lugar de introducir el texto dentro de un entorno 
  de proceso de textos especial, los fuentes del texto pueden ser modificados 
  con cualquier editor de textos como vi o Emacs. Una vez el texto fuente esta 
  completo (en el lenguaje de composici&oacute;n), el usuario formatea el texto 
  con un programa separado, que convierte el texto fuente a un formato adecuado 
  para la impresi&oacute;n. Esto es en cierta forma an&aacute;logo a programar 
  en un lenguaje como C, y "compilar" el documento a una forma imprimible.<br>
  </font><font color="#000000" size="2">Hay 
  muchos formateadores de textos disponibles para Linux. Uno es groff, la versi&oacute;n 
  GNU del cl&aacute;sico nroff originalmente desarrollado por Bell Labs y todav&iacute;a 
  usado en muchos sistemas UNIX por todo el mundo. Otro sistema de formateado 
  de textos moderno es TEX, desarrollado por Donald Knuth de gran popularidad. 
  Dialectos de TEX, como LATEX, tambi&eacute;n est&aacute;n disponibles. Formateadores 
  de texto como TEX y groff difieren entre si principalmente en la sintaxis del 
  lenguaje de composici&oacute;n. La elecci&oacute;n de un sistema de formateo 
  frente a otro estar&aacute; basada en las utilidades disponibles para satisfacer 
  sus necesidades, as&iacute; como en su gusto personal.</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">4 N. del T.: WYSIWYG: "What-You-See-Is-What-You-Get". 
  "Lo-que-ves-es-lo-que-obtienes"</font></P>
<P><font color="#000000" size="2">Por ejemplo, algunas personas consideran que 
  el lenguaje de composici&oacute;n de groff es un poco oscuro por lo que usan 
  TEX, que es mas legible para humanos. Pero, groff es capaz de producir salida 
  en ASCII llano, visualizable en un terminal, mientras que TEX esta destinado 
  principalmente para salida a impresora. Por lo tanto, existen varios programas 
  para producir salida ASCII de documentos formateados con TEX, o para convertir 
  TEX a groff.<br>
  </font><font color="#000000" size="2">Otro sistema de formateo de texto es texinfo, 
  una extensi&oacute;n de TEX usada para la documentaci&oacute;n de programas 
  por la 'Free Software Foundation'. texinfo es capaz de producir documentos impresos 
  o un documento "Info" con hiperenlaces por los que nos podemos mover desde un 
  &uacute;nico fichero fuente. Los ficheros Info son el formato principal de documentaci&oacute;n 
  usado por paquetes de GNU como Emacs.<br>
  </font><font color="#000000" size="2">Los formateadores de texto son usados 
  ampliamente en la comunidad inform&aacute;tica para producir informes, tesis, 
  art&iacute;culos de revistas y libros (de hecho, este libro ha sido producido 
  con LATEX). La capacidad de procesar el lenguaje fuente como un fichero de texto 
  llano abre la puerta a muchas extensiones al formateado de texto en si, puesto 
  que los documentos no son guardados en un oscuro formato, legible solo por un 
  procesador de textos particular, los programadores tienen la posibilidad de 
  escribir analizadores y traductores para el lenguaje de composici&oacute;n y 
  extender el sistema.<br>
  </font><font color="#000000" size="2">¿Que aspecto tiene el lenguaje de composici&oacute;n? 
  En general, el texto fuente consiste principalmente en el texto en si mismo, 
  junto con "c&oacute;digos de control" para producir efectos particulares, como 
  cambio de tipo de letra, seleccionar m&aacute;rgenes, crear listas, etc. Como 
  ejemplo, tomemos el siguiente texto:</font></P>
<DIR> 
  <DIR> 
    <P><font color="#000000" size="2">Sr. Torvalds:</font></P>
    <P><font color="#000000" size="2">Estamos muy preocupados con sus planes actuales 
      de a&ntilde;adir sugesti&oacute;n post-hipn&oacute;tica en el c&oacute;digo 
      del terminal de Linux. Nos sentimos as&iacute; por tres razones:<br>
      </font><font color="#000000" size="2">1. Mostrar mensajes subliminales en 
      el terminal no es solo inmoral, sino una p&eacute;rdida de tiempo;<br>
      </font><font color="#000000" size="2">2. Ha sido probado que las sugestiones 
      post-hipn&oacute;ticas no son efectivas cuando se usan sobre `UNIX hackers' 
      desprevenidos;<br>
      </font><font color="#000000" size="2">3. Ya hemos a&ntilde;adido descargas 
      el&eacute;ctricas de alto voltaje como medida de seguridad en el c&oacute;digo 
      de login.<br>
      </font><font color="#000000" size="2">Esperamos que lo reconsidere.</font></P>
  </DIR>
</DIR>
<P><font color="#000000" size="2">Este texto aparecer&iacute;a en el lenguaje 
  de formateo de LATEX como sigue:</font></P>
<DIR> 
  <DIR> 
    <P><font color="#000000" size="2">\begin{quote}<br>
      </font><font color="#000000" size="2">Sr. Torvalds:<br>
      </font><font color="#000000" size="2">Estamos muy preocupados con sus planes 
      actuales de a\~nadir<br>
      </font><font color="#000000" size="2">{\em sugesti\'on post-hipn\'otica\/} 
      en el c\'odigo del<br>
      </font><font color="#000000" size="2">terminal de {\bf Linux}. Nos sentimos 
      as\'{\i} por tres razones:<br>
      </font><font color="#000000" size="2">\begin{enumerate}<br>
      </font><font color="#000000" size="2">\item Mostrar mensajes subliminales 
      en el terminal no es solo<br>
      </font><font color="#000000" size="2">inmoral, sino una p\'erdida de tiempo;<br>
      </font><font color="#000000" size="2">\item Ha sido probado que las sugestiones 
      post-hipn\'oticas<br>
      </font><font color="#000000" size="2">no son efectivas cuando se usan sobre 
      `UNIX hackers'<br>
      </font><font color="#000000" size="2">desprevenidos;<br>
      </font><font color="#000000" size="2">\item Ya hemos a\~nadido descargas 
      el\'ectricas de alto voltaje<br>
      </font><font color="#000000" size="2">como medida de seguridad en el c\'odigo 
      de {\tt login}.<br>
      </font><font color="#000000" size="2">\end{enumerate}<br>
      </font><font color="#000000" size="2">Esperamos que lo reconsidere.<br>
      </font><font color="#000000" size="2">\end{quote}</font></P>
  </DIR>
</DIR>
<P><font color="#000000" size="2">El autor escribe el texto `fuente' anterior 
  usando un editor de texto y genera la salida formateada procesando el texto 
  con LATEX. A primera vista, el lenguaje de composici&oacute;n puede parecer 
  oscuro, pero es realmente f&aacute;cil de aprender. Usar un sistema de formateo 
  de textos hace cumplir las normas topogr&aacute;ficas en la escritura. Por ejemplo, 
  todas las listas enumeradas dentro del documento tendr&aacute;n el mismo aspecto, 
  aunque el autor modifique la definici&oacute;n del `entorno' de la lista enumerada. 
  La meta principal es permitir al autor concentrarse en la escritura del texto 
  en lugar de preocuparse por las convenciones topogr&aacute;ficas.<br>
  </font><font color="#000000" size="2">Los procesadores de texto WYSIWYG son 
  atractivos por muchas razones; proporcionan un poderoso (y a veces complejo) 
  interface visual para la edici&oacute;n del documento. Pero este interface esta 
  inherentemente limitado por aquellos aspectos de la estructura del texto que 
  son accesibles al usuario. Por ejemplo, muchos procesadores de texto proporcionan 
  un 'lenguaje de formateado' especial para producir expresiones complicadas como 
  pueden ser las formulas matem&aacute;ticas. Esto es id&eacute;ntico al formateado 
  de textos, aunque en una escala mucho menor.<br>
  </font><font color="#000000" size="2">El sutil beneficio del formateado de textos 
  es que el sistema te permite especificar exactamente lo que quieres. Tambi&eacute;n, 
  los formateadores de texto permiten editar el texto fuente con cualquier editor 
  de texto y el fuente es f&aacute;cilmente convertible a otros formatos. Esta 
  flexibilidad y potencia la obtenemos a cambio de renunciar al interface WYSIWYG.<br>
  </font><font color="#000000" size="2">Muchos usuarios de procesadores de texto 
  est&aacute;n acostumbrados a ver el texto formateado tal y como lo editaron. 
  Por otra parte, cuando se escribe con un formateador de texto, generalmente 
  no nos preocupamos sobre el aspecto que tendr&aacute; una vez formateado. El 
  escritor aprende a imaginarse el aspecto que tendr&aacute; el texto una vez 
  formateado a partir de las &oacute;rdenes de formateado usadas en el fuente.<br>
  </font><font color="#000000" size="2">Hay programas que permiten ver el documento 
  formateado en una pantalla gr&aacute;fica antes de imprimirlo. Por ejemplo, 
  xdvi visualiza un fichero `independiente de dispositivo' generado por TEX en 
  X-Windows. Otras aplicaciones, como xfig proporcionan interfaces gr&aacute;ficos 
  WYSIWYG para dibujar, los cuales son posteriormente convertidos al lenguaje 
  de formateo de textos para su inclusi&oacute;n en el documento.<br>
  </font><font color="#000000" size="2">Los formateadores de texto como nroff 
  est&aacute;n disponibles desde mucho antes de que apareciesen los procesadores 
  de texto. Sin embargo, mucha gente todav&iacute;a prefiere el uso de los formateadores 
  de texto porque son mas vers&aacute;tiles e independientes del entorno gr&aacute;fico. 
  En cualquier caso, el procesador de textos idoc esta tambi&eacute;n disponible 
  en Linux y no pasara mucho tiempo hasta que tambi&eacute;n veamos procesadores 
  de texto comerciales disponibles. Si de ninguna forma quieres renunciar al proceso 
  de texto en favor del formateo de textos, siempre puedes ejecutar MS-DOS o alg&uacute;n 
  otro sistema operativo adem&aacute;s de Linux.<br>
  </font><font color="#000000" size="2">Hay disponibles muchas otras utilidades 
  relacionadas con el formateo de textos. El potente sistema METAFONT, usado para 
  dise&ntilde;ar fuentes para TEX, esta incluido el la distribuci&oacute;n de 
  TEX para Linux. Otros programas incluyen ispell, un corrector ortogr&aacute;fico 
  interactivo; makeindex, usado para generar &iacute;ndices en documentos LATEX; 
  as&iacute; como muchos paquetes de macros para groff y TEX para el formateo 
  de diferentes tipos de documentos y textos matem&aacute;ticos. Hay disponibles 
  programas de conversi&oacute;n entre fuentes de TEX y groff a miles de otros 
  formatos.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.4.3"></a>1.4.3 Lenguajes 
  de programaci&oacute;n y utilidades: </font><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.4.2">Anterior</a>- 
  <a href="#1.4.4">Siguiente </a>- <a href="#indice">&Iacute;ndice</a> </font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b></font></u></font></u></font></P>
<P><font color="#000000" size="2">Linux proporciona un completo entorno de programaci&oacute;n 
  UNIX, incluyendo todas las librer&iacute;as est&aacute;ndar, herramientas de 
  programaci&oacute;n, compiladores, depuradores y todo aquello que esperar&iacute;as 
  encontrar en otro sistema UNIX. En el mundo del desarrollo de programas UNIX, 
  las aplicaciones y sistemas suelen ser programados en C o C++. El compilador 
  est&aacute;ndar de C y C++ para Linux es el GNU gcc, el cual es un avanzado 
  y moderno compilador que permite multitud de opciones. Es tambi&eacute;n capaz 
  de compilar C++ (incluyendo las caracter&iacute;sticas de AT&amp;T 3.0) as&iacute; 
  como en Objetive-C y otros dialectos de C orientados a objetos.<br>
  </font><font color="#000000" size="2">Adem&aacute;s de C y C++ han sido llevados 
  a Linux muchos otros lenguajes de programaci&oacute;n tanto interpretados como 
  compilados, como Smalltalk, FORTRAN, Pascal, LISP, Scheme, Ada (si es tan masoquista 
  como para programar en Ada, no le detendremos). Adem&aacute;s hay disponibles 
  varios ensambladores para escribir c&oacute;digo del 80386 en modo protegido. 
  Los lenguajes favoritos de UNIX como Perl (el lenguaje de guiones para terminar 
  con todos los lenguajes de guiones) y Tcl/Tk (un procesador de &oacute;rdenes 
  al estilo del interprete de comandos incluyendo soporte para desarrollar aplicaciones 
  simples para X-Window).<br>
  </font><font color="#000000" size="2">El depurador avanzado gdb tambi&eacute;n 
  ha sido llevado a Linux. Permite examinar los programas para localizar errores, 
  o examinar la causa de un "cuelgue" usando un volcado del sistema (core dump). 
  gprof utilidad de perfilado que permite obtener estad&iacute;sticas de prestaciones 
  de sus programas, permitiendo saber en que parte de su programa se va la mayor 
  parte del tiempo de ejecuci&oacute;n.<br>
  </font><font color="#000000" size="2">El editor Emacs proporciona un entorno 
  interactivo de edici&oacute;n y compilaci&oacute;n para varios lenguajes de 
  programaci&oacute;n. Otras herramientas incluyen GNU make e imake, usados para 
  dirigir el proceso de compilaci&oacute;n de aplicaciones grandes o RCS, sistema 
  de control de revisiones.<br>
  </font><font color="#000000" size="2">Linux dispone de librer&iacute;as compartidas 
  enlazadas din&aacute;micamente, lo que permite a los ejecutables ser mucho menores 
  al enlazar el c&oacute;digo de las librer&iacute;as en tiempo de ejecuci&oacute;n. 
  Estas librer&iacute;as DLL (Dinamically Linked Library) tambi&eacute;n permiten 
  al programador de aplicaciones sustituir funciones ya definidas con su propio 
  c&oacute;digo. Por ejemplo, si un programador desea escribir su propia versi&oacute;n 
  de la funci&oacute;n de librer&iacute;a malloc(), el editor de enlaces usar&iacute;a 
  la nueva rutina del programador en lugar de la que se encuentra en las librer&iacute;as.<br>
  </font><font color="#000000" size="2">Linux es ideal para desarrollar aplicaciones 
  UNIX, proporciona un moderno entorno de programaci&oacute;n con todos los detalles 
  y funcionalidad necesarios. Se soportan varios est&aacute;ndares como POSIX.1, 
  permitiendo a los programas escritos para Linux ser f&aacute;cilmente llevados 
  a otros sistemas.<br>
  </font><font color="#000000" size="2">Los programadores profesionales de UNIX 
  y administradores de sistemas pueden usar Linux para desarrollar programas en 
  casa y luego transferir los programas a los sistemas UNIX del trabajo.<br>
  </font><font color="#000000" size="2">Esto no solo puede ahorrar una gran cantidad 
  de tiempo y dinero, sino que tambi&eacute;n le permitir&aacute; trabajar con 
  la comodidad de su propia casa.5 Los estudiantes de inform&aacute;tica pueden 
  usar Linux para aprender la programaci&oacute;n en UNIX y explorar otros aspectos 
  del sistema como la arquitectura del n&uacute;cleo.<br>
  </font><font color="#000000" size="2">Con Linux, no solo tienes acceso a un 
  conjunto completo de librer&iacute;as y utilidades de programaci&oacute;n, tambi&eacute;n 
  tiene acceso al c&oacute;digo fuente completo del n&uacute;cleo y las librer&iacute;as.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.4.4"></a>1.4.4 El sistema 
  X-Window: </font><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.4.3">Anterior</a>- 
  <a href="#1.4.5">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font><font color="#000000" size="2"></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000" size="2"> 
  </font></font></u></b></font></font></u></b></font></font></u></b></font></font></u></b></font></u></font></u></font><font size="2"><br>
  </font></u></b></font></font></u></b></font></u></font></u></font></P>
<P><font color="#000000" size="2">El sistema X-Window es un interface gr&aacute;fico 
  est&aacute;ndar para maquinas UNIX. Es un potente entorno que soporta muchas 
  aplicaciones. Usando X-Windows, el usuario puede tener m&uacute;ltiples terminales 
  a la vez en ventanas sobre la pantalla, cada una conteniendo una sesi&oacute;n 
  diferente. Un dispositivo apuntador como el rat&oacute;n es usado a menudo en 
  el interface X, pero no es indispensable.<br>
  </font><font color="#000000" size="2">Han sido escritas muchas aplicaciones 
  espec&iacute;ficamente para X, como juegos, utilidades gr&aacute;ficas, herramientas 
  de programaci&oacute;n y documentaci&oacute;n, y muchas mas. Con Linux y X, 
  su sistema es una autentica estaci&oacute;n de trabajo. Junto con una red TCP/IP 
  puede incluso visualizar aplicaciones que se est&aacute;n ejecutando en otras 
  maquinas en su pantalla local, tal y como es posible con otros sistemas corriendo 
  X.<br>
  </font><font color="#000000" size="2">El sistema X-Window fue desarrollado originalmente 
  en el MIT y es de libre distribuci&oacute;n. A pesar de esto muchas empresas 
  han distribuido sus mejoras particulares al dise&ntilde;o original de X-Window. 
  La versi&oacute;n de X-Window disponible para Linux es conocida como XFree86, 
  una adaptaci&oacute;n de X11R56 de libre distribuci&oacute;n para sistemas UNIX 
  basados en 80386, como es Linux. XFree86 soporta una gran variedad de tarjetas 
  de v&iacute;deo, incluyendo VGA, Super VGA y gran cantidad de tarjetas aceleradoras 
  de v&iacute;deo. Esta es una distribuci&oacute;n completa de X Windows conteniendo 
  el servidor de X, muchas aplicaciones y utilidades, librer&iacute;as de programaci&oacute;n 
  y documentaci&oacute;n.<br>
  </font><font color="#000000" size="2">Aplicaciones X est&aacute;ndar incluyen 
  xterm (emulador de terminal usado por la mayor&iacute;a de las aplicaciones 
  en modo texto dentro de X); xdm (el gestor de sesiones, maneja los 'login'); 
  xclock (un reloj simple); xman (un lector de paginas de manual para X) y muchos 
  mas. El numero de aplicaciones disponibles para X-Windows en Linux es demasiado 
  numeroso como para mencionarlas aqu&iacute;, pero la distribuci&oacute;n b&aacute;sica 
  de XFree86 incluye las aplicaciones `est&aacute;ndar' que se encontraban en 
  la versi&oacute;n original del MIT. Muchas otras est&aacute;n disponibles separadamente 
  y te&oacute;ricamente cualquier aplicaci&oacute;n escrita para X Windows deber&iacute;a 
  compilar limpiamente bajo Linux.<br>
  </font><font color="#000000" size="2">El aspecto 
  y comportamiento del interface de las X Windows esta controlado por el controlador 
  de ventanas. Este amigable programa es el encargado de la situaci&oacute;n de 
  las ventanas, redimensionado, iconizaci&oacute;n, movimiento de las ventanas, 
  aspecto de los marcos de las ventanas, etc. La distribuci&oacute;n est&aacute;ndar 
  XFree86 incluye twm, el cl&aacute;sico controlador de ventanas del MIT, aunque 
  hay disponibles controladores mucho mas avanzados como Open Look Virtual Window 
  Manager (olvwm).</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">5 El autor usa su sistema Linux para desarrollar 
  y probar aplicaciones X Window en casa, que pueden ser directamente compiladas 
  en estaciones de trabajo en cualquier parte.</font></P>
<P><font color="#000000" size="2">6 N. del T.: Linux dispone en la actualidad 
  de la versi&oacute;n X11R6 de X Window</font></P>
<P><font color="#000000" size="2">Un controlador de ventanas muy popular entre 
  los usuarios de Linux es el fvwm. Es un peque&ntilde;o controlador que requiere 
  menos de la mitad de la memoria usada por twm. Proporciona aspecto de 3D para 
  las ventanas, as&iacute; como un escritorio virtual si el usuario desplaza el 
  rat&oacute;n al borde de la pantalla, la pantalla entera es desplazada como 
  fuese mucho mas grande de lo que realmente es. fvwm es altamente configurable 
  y permite acceso a todas las funciones tanto desde el teclado como desde el 
  rat&oacute;n. Muchas distribuciones de Linux usan fvwm como controlador de ventanas 
  est&aacute;ndar.<br>
  </font><font color="#000000" size="2">La distribuci&oacute;n XFree86 contiene 
  librer&iacute;as para programaci&oacute;n y ficheros de cabecera para aquellos 
  programadores ma&ntilde;osos que deseen desarrollar aplicaciones para X. Est&aacute;n 
  soportados varios conjuntos de controles como los de Athena, Open Look y Xaw3D. 
  Todas las fuentes est&aacute;ndar, mapas de bits, paginas de manual y documentaci&oacute;n 
  esta incluida. PEX (interface de programaci&oacute;n para gr&aacute;ficos 3D) 
  tambi&eacute;n esta soportado.<br>
  </font><font color="#000000" size="2">Muchos programadores de aplicaciones para 
  X usan el conjunto comercial de controles Motif para el desarrollo. Algunos 
  vendedores proporcionan licencias simples o multiusuario de una versi&oacute;n 
  ejecutable de Motif para Linux, pero como Motif en si, es bastante caro, no 
  lo poseen demasiados usuarios de Linux. A pesar de todo, ejecutables est&aacute;ticamente 
  enlazados con las librer&iacute;as de Motif pueden ser libremente distribuidos. 
  Por lo tanto, si escribes un programa usando Motif y deseas distribuirlo libremente, 
  deber&aacute;s de proporcionar un ejecutable con las librer&iacute;as enlazadas 
  est&aacute;ticamente para que los usuarios que no posean Motif puedan usar el 
  programa.<br>
  </font><font color="#000000" size="2">La &uacute;nica advertencia con las X-Windows 
  son los requerimientos de maquina y memoria. Un 386 con 4 Mb de RAM es capaz 
  de ejecutar las X, pero para usarlo adecuadamente ser&aacute;n necesarios 8 
  Mb o mas. Tambi&eacute;n es recomendable usar un procesador r&aacute;pido, pero 
  tener mayor cantidad de memoria f&iacute;sica es mucho mas importante. Adem&aacute;s, 
  para conseguir realmente buenas prestaciones de v&iacute;deo, es muy recomendable 
  usar una tarjeta aceleradora (como las tarjetas local bus con aceleradores gr&aacute;ficos 
  S3). Se han conseguido &iacute;ndices de prestaciones por encima de los 140.000 
  Xstones con XFree86 y Linux. Con suficiente hardware, encontrara que ejecutar 
  X en Linux es tan r&aacute;pido o mas r&aacute;pido que ejecutar X en otras 
  estaciones de trabajo UNIX.<br>
  </font><font color="#000000" size="2">En el Capitulo 
  5 se tratara sobre como instalar y usar las X en su propio sistema.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.4.5"></a>1.4.5 Redes: </font><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000" size="2"><br>
  </font></font></u></b></font></font></u></b></font></font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.4.4">Anterior</a>- 
  <a href="#1.4.6">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font><font color="#000000" size="2"><br>
  </font></font></u></font></font></u></font><font size="2"></font></font></u></font></font></u></font></u></font></u></font></P>
<P><font color="#000000" size="2">¿Esta interesado en comunicarse con el mundo? 
  ¿Si? ¿No? ¿Quiz&aacute;s? Linux dispone de los dos principales protocolos de 
  red para sistemas UNIX: TCP/IP y UUCP. TCP/IP (para los aficionados a los acr&oacute;nimos, 
  Transmission Control Protocol/Internet Protocol) es un conjunto de protocolos 
  de red que permite a sistemas de todo el mundo comunicarse en una &uacute;nica 
  red conocida como Internet.<br>
  </font><font color="#000000" size="2">Con Linux, TCP/IP y una conexi&oacute;n 
  a la red, puede comunicarse con usuarios y maquinas por toda Internet mediante 
  correo electr&oacute;nico, noticias (USENET news), transferencias de ficheros 
  con FTP y mucho mas. Actualmente hay muchos sistemas Linux conectados a Internet.<br>
  </font><font color="#000000" size="2">La mayor&iacute;a de las redes TCP/IP 
  usan Ethernet como tipo de red f&iacute;sica de transporte. Linux da soporte 
  a muchas tarjetas de red Ethernet e interfaces para ordenadores personales, 
  incluyendo el adaptador Ethernet D-Link de bolsillo para ordenadores port&aacute;tiles.<br>
  </font><font color="#000000" size="2">Pero dado que no todo el mundo tiene una 
  conexi&oacute;n Ethernet en casa, Linux tambi&eacute;n proporciona SLIP 7 (Serial 
  Line Internet Protocol), el cual permite conectarse a Internet a trav&eacute;s 
  de un m&oacute;dem.<br>
  </font><font color="#000000" size="2">Para poder usar SLIP, necesitara tener 
  acceso a un servidor de SLIP, una maquina conectada a la red que permite acceso 
  de entrada por tel&eacute;fono. Muchas empresas y universidades tienen servidores 
  SLIP disponibles. De hecho, si su sistema Linux dispone de conexi&oacute;n Ethernet 
  y de m&oacute;dem, puede configurarlo como servidor de SLIP para otros usuarios.<br>
  </font><font color="#000000" size="2">NFS (Network File System) permite f&aacute;cilmente 
  compartir ficheros con otras maquinas de la red.<br>
  </font><font color="#000000" size="2">FTP (File Transfer Protocol) permite la 
  transferencia de ficheros entre maquinas. Otras aplicaciones incluyen sendmail, 
  sistema para enviar y recibir correo electr&oacute;nico usando el protocolo 
  SMTP; Sistemas de noticias (news) basados en NNTP como C-News e INN; telnet, 
  rlogin y rsh, que permiten iniciar una sesi&oacute;n y ejecutar &oacute;rdenes 
  en otras maquinas de la red; y finger, que permite obtener informaci&oacute;n 
  de otros usuarios de Internet. Hay literalmente cientos de aplicaciones basadas 
  en TCP/IP y protocolos disponibles por la red.<br>
  </font><font color="#000000" size="2">Todos los lectores de correo y noticias 
  est&aacute;n disponibles para Linux, como elm, pine, rn, nn y tin. Sea cual 
  sea tus preferencias, puedes configurar tu sistema Linux para enviar y recibir 
  correo electr&oacute;nico y noticias por todo el mundo.<br>
  </font><font color="#000000" size="2">Si tienes experiencia con aplicaciones 
  TCP/IP en otros sistemas UNIX, Linux te ser&aacute; muy familiar. El sistema 
  proporciona el interface est&aacute;ndar de programaci&oacute;n por 'sockets', 
  lo que virtualmente permite que cualquier programa que use TCP/IP pueda ser 
  llevado a Linux. El servidor Linux de X tambi&eacute;n soporta TCP/IP, permitiendo 
  ver aplicaciones que est&aacute;n corriendo en otros sistemas sobre tu pantalla.<br>
  </font><font color="#000000" size="2">En el Capitulo 5 trataremos sobre la configuraci&oacute;n 
  y puesta en marcha de TCP/IP, incluyendo SLIP para Linux.<br>
  </font><font color="#000000" size="2">UUCP (UNIX-to-UNIX Copy) es un viejo mecanismo 
  usado para transferir ficheros, correo electr&oacute;nico y noticias entre maquinas 
  UNIX. Cl&aacute;sicamente las maquinas UUCP conectan entre ellas mediante l&iacute;neas 
  telef&oacute;nicas y m&oacute;dem, pero UUCP es capaz de funcionar tambi&eacute;n 
  sobre una red TCP/IP. Si no tienes acceso a una red TCP/IP o a un servidor SLIP, 
  puedes configurar tu sistema para enviar y recibir ficheros y correo electr&oacute;nico 
  usando UUCP. Ver el Capitulo 5 para mas informaci&oacute;n.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.4.6"></a>1.4.6 Programas 
  de comunicaciones y BBS: </font><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.4.5">Anterior</a>- 
  <a href="#1.4.7">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b></font></u></font></u></font></P>
<P><font color="#000000" size="2">Si tienes un m&oacute;dem ser&aacute;s capaz 
  de comunicarte con otras maquinas usando alguno de los paquetes de comunicaciones 
  disponibles para Linux. Mucha gente usa programas de comunicaciones para acceder 
  a BBSs, as&iacute; como a servicios comerciales en l&iacute;nea, como Prodigy, 
  CompuServe y America On-Line. Otras personas usan sus m&oacute;dems para conectar 
  a un sistema UNIX en el trabajo o escuela. Puedes usar incluso tu m&oacute;dem 
  y sistema Linux para enviar y recibir FAX. Los programas de comunicaciones para 
  Linux son muy parecidos a los que se pueden encontrar para MS-DOS y otros sistemas 
  operativos. Todo aquel que haya usado alguna vez un paquete de comunicaciones 
  encontrara un equivalente familiar en Linux.</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">7 N. del T.: Linux tambi&eacute;n dispone, entre 
  otros, de soporte PPP: Point to Point Protocol.</font></P>
<P><font color="#000000" size="2">Uno de los paquetes de comunicaciones mas populares 
  para Linux es Seyon, una aplicaci&oacute;n para X que proporciona un interface 
  configurable y ergon&oacute;mico con soporte incorporado de varios protocolos 
  de transferencia de ficheros como Kermit, ZModem y otros. Otros programas de 
  comunicaciones incluyen C-Kermit, pcomm y minicom. Estos &uacute;ltimos son 
  similares a programas de comunicaciones que se pueden encontrar en otros sistemas 
  operativos y son muy f&aacute;ciles de usar.<br>
  </font><font color="#000000" size="2">Si no tienes acceso a un servidor de SLIP 
  (ver la secci&oacute;n anterior), puedes usar term para multiplexar la l&iacute;nea 
  serie. term te permitir&aacute; abrir m&uacute;ltiples sesiones a trav&eacute;s 
  de la conexi&oacute;n por m&oacute;dem a una maquina remota. term tambi&eacute;n 
  te permitir&aacute; redireccionar las conexiones de un cliente X a tu servidor 
  local de X, a trav&eacute;s de la l&iacute;nea serie, permiti&eacute;ndote visualizar 
  aplicaciones X remotas en tu terminal local. Otro paquete disponible, KA9Q, 
  proporciona un interface similar al SLIP.<br>
  </font><font color="#000000" size="2">Mantener un sistema de BBS es el hobby 
  favorito de mucha gente. Linux proporciona una gran variedad de programas de 
  BBS, la mayor&iacute;a de los cuales son mas potentes que los disponibles para 
  otros sistemas operativos. Con una l&iacute;nea telef&oacute;nica, un m&oacute;dem 
  y Linux, puedes convertir tu sistema en una BBS, proporcionando acceso telef&oacute;nico 
  a tu sistema a usuarios de todo el mundo.<br>
  </font><font color="#000000" size="2">Los programas de BBS para Linux incluyen 
  XBBS y UniBoard BBS.<br>
  </font><font color="#000000" size="2">La mayor&iacute;a de los programas de 
  BBS mantienen al usuario en un sistema basado en men&uacute;s donde solo hay 
  disponibles ciertas funciones y programas. Una alternativa a este acceso a la 
  BBS es el acceso UNIX completo, lo que significa que el usuario llama y entra 
  en el sistema como un usuario regular (a trav&eacute;s de un "login"). Aunque 
  este procedimiento requiere mayor mantenimiento y atenci&oacute;n por parte 
  del administrador del sistema, puede hacerse, y proporcionar acceso publico 
  a UNIX desde el sistema Linux no es dif&iacute;cil. Junto con una red TCP/IP, 
  puedes proporcionar acceso a correo electr&oacute;nico y noticias a los usuarios 
  del sistema.<br>
  </font><font color="#000000" size="2">Si no tienes acceso a una red TCP/IP o 
  UUCP, Linux tambi&eacute;n te permitir&aacute; comunicarte con la gran cantidad 
  de redes de BBS, como FidoNet, en la cual puedes intercambiar correo electr&oacute;nico 
  y noticias por la l&iacute;nea telef&oacute;nica. En el Capitulo 5 encontraras 
  mas informaci&oacute;n sobre programas para comunicaciones y BBS bajo Linux.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.4.7"></a>1.4.7 Enlazando 
  con MS-DOS: </font><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000" size="2"><br>
  </font></font></u></b></font></font></u></b></font></font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.4.6">Anterior</a>- 
  <a href="#1.4.8">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font><font color="#000000" size="2"></font></font></u></font></font></u></font></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000" size="2"><br>
  </font></font></u></b></font></font></u></b></font></font></u></b></font></font></u></b></font></u></font></u></font></P>
<P><font color="#000000" size="2">Existen varias utilidades para enlazar con el 
  mundo de MS-DOS. El mas conocido es el emulador de MS-DOS para Linux, que permite 
  ejecutar muchas aplicaciones de MS-DOS directamente desde Linux. Aunque Linux 
  y MS-DOS son dos sistemas operativos totalmente diferentes, el modo protegido 
  del 80386 permite que ciertas tareas se comporten como si estuviesen en un 8086 
  tal y como hacen las aplicaciones de MS-DOS.<br>
  </font><font color="#000000" size="2">El emulador de MS-DOS esta todav&iacute;a 
  bajo desarrollo, aunque muchos de los programas mas populares corren sobre el. 
  Por lo tanto, es comprensible que programas MS-DOS que usan caracter&iacute;sticas 
  extra&ntilde;as o esot&eacute;ricas del sistema, puede que nunca est&eacute;n 
  soportados, puesto que solo es un emulador. Por ejemplo, no espere que sea posible 
  ejecutar programas que usan las caracter&iacute;sticas del 80386 en modo protegido 
  como Microsoft Windows (en modo mejorado de 386). Aplicaciones que corren sin 
  problemas bajo el emulador de MS-DOS incluyen 4DOS (interprete de comandos), 
  Foxpro 2.0, Harvard Graphics, MathCad, Stacker 3.1, Turbo Assembler, Turbo C/C++, 
  Turbo Pascal, Microsoft Windows 3.0 (en modo real) y WordPerfect 5.1. Los comandos 
  y utilidades est&aacute;ndar de MS-DOS (como PKZIP,... etc) funcionan tambi&eacute;n 
  con el emulador.<br>
  </font><font color="#000000" size="2">El emulador de MS-DOS es principalmente 
  una soluci&oacute;n `ad-hoc' para aquellos usuarios que necesitan MS-DOS solo 
  para unas pocas aplicaciones, pero usan Linux para todo lo dem&aacute;s. Eso 
  no significa que no sea una implementaci&oacute;n completa de MS-DOS. Por supuesto, 
  si el emulador no satisface tus necesidades, siempre se puede usar MS-DOS junto 
  con Linux en el mismo sistema.<br>
  </font><font color="#000000" size="2">Usando el gestor de arranque LILO puedes 
  especificar en el arranque que sistema operativo se desea arrancar. Linux puede 
  coexistir con otros sistemas operativos, como OS/2, etc.<br>
  </font><font color="#000000" size="2">Linux proporciona un interface sin fisuras 
  para transferir ficheros entre Linux y MS-DOS. Se puede montar una partici&oacute;n 
  MS-DOS o disco flexible bajo Linux y acceder directamente a los ficheros MS-DOS 
  como se har&iacute;a con ficheros de Linux.<br>
  </font><font color="#000000" size="2">Actualmente existe en desarrollo un proyecto 
  conocido como WINE_ que es un emulador de Microsoft Windows para X-Windows bajo 
  Linux. Cuando WINE este completado, los usuarios podr&aacute;n ejecutar aplicaciones 
  MS-Windows directamente desde Linux, similar al emulador de Windows WABI de 
  Sun Microsystems. Al tiempo de escribir este texto, WINE esta todav&iacute;a 
  en las primeras etapas del desarrollo, pero tiene muy buenas perspectivas.<br>
  </font><font color="#000000" size="2">En 
  el Capitulo 5 hablaremos de las herramientas MS-DOS disponibles para Linux.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.4.8"></a>1.4.8 Otras aplicaciones: 
  </font><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.4.7">Anterior</a>- 
  <a href="#1.5">Siguiente </a>- <a href="#indice">&Iacute;ndice</a> </font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font><font size="2"></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></u></font></u></font></P>
<P><font color="#000000" size="2">Tal y como se podr&iacute;a esperar de tal mezcolanza 
  de sistema operativo, hay una gran cantidad de miscel&aacute;nea disponible 
  para Linux. La intenci&oacute;n primaria de Linux es, actualmente, el uso personal 
  de UNIX, pero esto esta cambiando r&aacute;pidamente. Programas de negocios 
  y cient&iacute;ficos se est&aacute;n expandiendo y los vendedores de programas 
  comerciales est&aacute;n comenzando a contribuir al crecimiento del numero de 
  aplicaciones disponibles para Linux.<br>
  </font><font color="#000000" size="2">Est&aacute;n disponibles para Linux varias 
  bases de datos relacionales, incluyendo Postgres, Ingres y Mbase. Estas tienen 
  todas las caracter&iacute;sticas de aplicaciones de bases de datos cliente/servidor 
  similares a las que se pueden encontrar en otras plataformas UNIX. /rdb, un 
  sistema de base de datos comercial9 esta tambi&eacute;n disponible.<br>
  </font><font color="#000000" size="2">Aplicaciones de calculo cient&iacute;fico 
  incluyen FELT (herramienta de an&aacute;lisis de elementos finitos); gnuplot 
  (aplicaci&oacute;n de an&aacute;lisis y representaci&oacute;n gr&aacute;fica 
  de datos); Octave (matem&aacute;tica simb&oacute;lica, similar a MATLAB); xspread 
  (hoja de calculo); fractint, versi&oacute;n para X del popular generador de 
  fractales Fractint; xlispstat (paquete estad&iacute;stico), y muchos mas. Otras 
  aplicaciones incluyen a Spice (herramienta de dise&ntilde;o y an&aacute;lisis 
  de circuitos) y Khoros (proceso de se&ntilde;ales im&aacute;genes/digital y 
  sistema de visualizaci&oacute;n).</font></P>
<P><font color="#000000" size="2">_____________________________________________ 
  </font></P>
<P><font color="#000000" size="2">8 N. del T.: Determinadas aplicaciones Windows 
  3.1 funcionan, aunque en fase experimental, bajo diversos emuladores</font></P>
<P><font color="#000000" size="2">9 N. del T.: En el momento de realizar esta 
  traducci&oacute;n ya exist&iacute;an varios paquetes de Bases de Datos comerciales 
  portadas a Linux. Van desde compatibilidad con Clipper 5.x hasta soporte SQL 
  entre otros<br>
  </font><font color="#000000" size="2">Por supuesto, hay muchas mas 
  aplicaciones que han sido y pueden ser llevadas a Linux. Sea cual sea su campo 
  de trabajo, trasladar aplicaciones UNIX a Linux deber&iacute;a ser bastante 
  directo.<br>
  </font><font color="#000000" size="2">Linux proporciona un completo entorno 
  de programaci&oacute;n UNIX, suficiente para servir de base a aplicaciones cient&iacute;ficas.<br>
  </font><font color="#000000" size="2">Como con cualquier sistema operativo, 
  Linux tiene su porci&oacute;n de juegos. Estos incluyen juegos cl&aacute;sicos 
  en modo texto como Nethack y Moria; MUDs (dragones y mazmorras multiusuario, 
  que permiten que los usuarios interaccionen en una aventura en modo texto) como 
  DikuMUD y TinyMUD; as&iacute; como juegos para X-Windows como tetris, netrek, 
  y Xboard (la versi&oacute;n para X11 de gnuchess). El popular juego `arcade' 
  de masacrar enemigos Doom tambi&eacute;n ha sido llevado a Linux.<br>
  </font><font color="#000000" size="2">Para audi&oacute;filos, Linux tiene soporte 
  para tarjetas de sonido y programas relacionados como CD-player (programa que 
  permite escuchar CD musicales en el lector de CD-ROM), secuenciadores MIDI y 
  editores (permiten componer m&uacute;sica para sintetizadores o cualquier instrumento 
  con controlador MIDI) y editores de sonidos digitalizados.<br>
  </font><font color="#000000" size="2">¿No puedes encontrar el programa que estas 
  buscando?. El `Linux Software Map' descrito en el Ap&eacute;ndice A contiene 
  una lista con gran cantidad de programas que han sido escritos o llevados a 
  Linux. Ciertamente, la lista esta lejos de ser completa, pero contiene una gran 
  cantidad de programas. Otra forma de encontrar aplicaciones para Linux, si tiene 
  acceso a Internet, es buscar en los ficheros INDEX que se encuentran en los 
  `Linux FTP sites'. A poco que hurgue a su alrededor, encontrara gran cantidad 
  de programas esperando a ser usados.<br>
  </font><font color="#000000" size="2">Si de ninguna forma puede encontrar lo 
  que necesita, siempre puede tratar de hacer una adaptaci&oacute;n de la aplicaci&oacute;n 
  desde otra plataforma a Linux. La mayor&iacute;a de los programas de libre distribuci&oacute;n 
  para UNIX compilaran en Linux sin ning&uacute;n problema. O si todo falla, puede 
  escribirse Vd. mismo el programa. Si lo que esta buscando es un programa comercial, 
  puede que exista un `clon' de libre difusi&oacute;n disponible. O puede sugerir 
  a la empresa que considere el lanzamiento de una versi&oacute;n de su programa 
  para Linux. Algunas personas han contactado con empresas de programaci&oacute;n 
  pidi&eacute;ndoles que lleven sus aplicaciones a Linux, y han obtenido varios 
  grados de &eacute;xito.</font></P>
<P><font color="#000000"><b><u><font size="2"><a name="1.5"></a><font size="3">1.5 
  Acerca del Copyright: </font><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.4.8">Anterior</a>- 
  <a href="#1.6">Siguiente </a>- <a href="#indice">&Iacute;ndice</a> </font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b></font></u></font></font></u></b></font></P>
<P><font color="#000000" size="2">Linux esta regido por lo que se conoce como 
  la Licencia Publica General de GNU, o GPL, General Public License. La GPL fue 
  desarrollada para el proyecto GNU por la Free Software Foundation, que podemos 
  traducir como "Fundaci&oacute;n por el Software Gratuito". La licencia hace 
  una serie de previsiones sobre la distribuci&oacute;n y modificaci&oacute;n 
  del "software gratis". "Gratis" en este sentido se refiere a libertad, y no 
  solo coste. La GPL puede ser interpretada de distintas formas, y esperamos que 
  este resumen le ayude a entenderla y como afecta a Linux. Se incluye una copia 
  completa de la Licencia al final del libro, en el ap&eacute;ndice F.<br>
  </font><font color="#000000" size="2">Originalmente, Linus Torvalds lanzo Linux 
  bajo una licencia mas restrictiva que la GPL, que permit&iacute;a que el software 
  fuera libremente distribuido y modificado, pero prohib&iacute;a su uso para 
  ganar dinero. Sin embargo, la GPL autoriza que la gente venda su software, aunque 
  no le permite restringir el derecho que su comprador tiene a copiarlo y venderlo 
  a su vez.<br>
  </font><font color="#000000" size="2">En primer lugar, hay que aclarar que el 
  "software gratis" de la GPL no es software de dominio publico. El software de 
  dominio publico carece de copyright y pertenece literalmente al publico.<br>
  </font><font color="#000000" size="2">El software regido por la GPL si tiene 
  el copyright de su autor o autores. Esto significa que esta protegido por las 
  leyes internacionales del copyright y que el autor del software esta declarado 
  legalmente. No solo porque un programa sea de libre distribuci&oacute;n puede 
  consider&aacute;rsele del dominio publico.<br>
  </font><font color="#000000" size="2">El software regido por la GPL tampoco 
  es "shareware". Por lo general, el "shareware" es propiedad del autor, y exige 
  a los usuarios que le paguen cierta cantidad por utilizarlo despu&eacute;s de 
  la distribuci&oacute;n. Sin embargo, el software que se rige por la GPL puede 
  ser distribuido y usado sin pagar a nadie.<br>
  </font><font color="#000000" size="2">La GPL permite a los usuarios modificar 
  el software y redistribuirlo. Sin embargo, cualquier trabajo derivado de un 
  programa GPL se regir&aacute; tambi&eacute;n por la GPL. En otras palabras, 
  una compa&ntilde;&iacute;a nunca puede tomar Linux, modificarlo y venderlo bajo 
  una licencia restringida. Si un software se deriva de Linux, este deber&aacute; 
  regirse por la GPL tambi&eacute;n.<br>
  </font><font color="#000000" size="2">La GPL permite distribuir y usar el software 
  sin cargo alguno. Sin embargo, tambi&eacute;n permite que una persona u organizaci&oacute;n 
  gane dinero distribuyendo el software. Sin embargo, cuando se venden programas 
  GPL, el distribuidor no puede poner ninguna restricci&oacute;n a la redistribuci&oacute;n. 
  Esto es, si usted compra un programa GPL, puede a su vez redistribuirlo gratis 
  o cobrando una cantidad.<br>
  </font><font color="#000000" size="2">Esto puede parecer contradictorio. ¿Por 
  que vender software cuando la GPL especifica que puede obtenerse gratis? Por 
  ejemplo, supongamos que una empresa decide reunir una gran cantidad de programas 
  GPL en un CD-ROM y venderlo. La empresa necesitara cobrar por el hecho de haber 
  producido el CD, y asimismo querr&aacute; ganar dinero. Esto esta permitido 
  por la GPL.<br>
  </font><font color="#000000" size="2">Las organizaciones que vendan el software 
  regido por la GPL deben tener en cuenta algunas restricciones. En primer lugar, 
  no pueden restringir ning&uacute;n derecho al comprador del programa. Esto significa 
  que si usted compra un CD-ROM con programas GPL, podr&aacute; copiar ese CD 
  y revenderlo sin ninguna restricci&oacute;n. En segundo lugar, los distribuidores 
  deben hacer saber que el software se rige por la GPL. En tercer lugar, el vendedor 
  debe proporcionar, sin coste adicional, el c&oacute;digo fuente del software 
  a distribuir. Esto permite a cualquiera comprar el software y modificarlo a 
  placer.<br>
  </font><font color="#000000" size="2">Permitir a una empresa distribuir y vender 
  programas que son gratis es bueno. No todo el mundo tiene acceso a Internet 
  para llevarse los programas, como Linux, gratis. La GPL permite a las empresas 
  vender y distribuir programas a esas personas que no pueden acceder al software 
  con un coste bajo. Por ejemplo, muchas empresas venden Linux en disquetes o 
  CD-ROM por correo, y hacen negocio de esas ventas. Los desarrolladores de Linux 
  pueden no tener constancia de estos negocios. Por ejemplo, Linus sabe que ciertas 
  compa&ntilde;&iacute;as venden Linux, y el no va a cobrar nada por esas ventas.<br>
  </font><font color="#000000" size="2">En el mundo de los programas gratis, lo 
  importante no es el dinero. El objetivo es permitir desarrollar y distribuir 
  software fant&aacute;stico asequible a cualquiera. En la siguiente secci&oacute;n, 
  hablaremos de como esto se aplica al desarrollo de Linux.</font></P>
<P><font color="#000000"><b><u><font size="2"><a name="1.6"></a><font size="3">1.6 
  Dise&ntilde;o y filosof&iacute;a de Linux: </font><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.5">Anterior</a>- 
  <a href="#1.6.1">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font><font color="#000000" size="2"></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></font></u></font></u></font></font></u></font></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000" size="2"> 
  </font></font></u></b></font></font></u></b></font></font></u></b></font></font></u></b></font></u></font></font></u></b></font><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b></font></u></font></font></u></b></font></P>
<P><font color="#000000" size="2">En ocasiones, los nuevos usuarios de Linux se 
  crean falsas expectativas acerca de este. Linux es un sistema operativo &uacute;nico, 
  y es importante entender su filosof&iacute;a y dise&ntilde;o para usarlo eficientemente.<br>
  </font><font color="#000000" size="2">Aunque usted sea un experimentado "guru" 
  del UNIX, lo que viene a continuaci&oacute;n le interesara con total seguridad.<br>
  </font><font color="#000000" size="2">En versiones comerciales de UNIX, el sistema 
  es desarrollado siguiendo una rigurosa pol&iacute;tica de mantenimiento de la 
  calidad, con sistemas de control de revisiones para las fuentes y documentaci&oacute;n, 
  etc. Los desarrolladores no pueden a&ntilde;adir cosas nuevas por su cuenta: 
  cualquier cambio ser&aacute; en respuesta a un informe de bug detectado, y ser&aacute; 
  cuidadosamente registrado en el sistema de control de versiones, de manera que 
  podr&aacute; volverse atr&aacute;s sin problemas. Cada desarrollador tiene asignada 
  una o mas partes del c&oacute;digo, y solo ese desarrollador puede alterar esas 
  secciones del c&oacute;digo.<br>
  </font><font color="#000000" size="2">Internamente, el departamento de calidad 
  realiza conjuntos de tests para cada versi&oacute;n del sistema operativo, e 
  informa de los errores. Es responsabilidad de los desarrolladores corregir esos 
  errores.<br>
  </font><font color="#000000" size="2">Se utiliza un complicado sistema de an&aacute;lisis 
  estad&iacute;stico para asegurarse de que cierto porcentaje de los errores son 
  corregidos antes de la pr&oacute;xima versi&oacute;n.<br>
  </font><font color="#000000" size="2">Como vemos, el proceso seguido por los 
  desarrolladores de UNIX comercial para mantenerlo y darle soporte es muy complicado, 
  pero razonable. La compa&ntilde;&iacute;a debe tener cierta seguridad de que 
  la pr&oacute;xima revisi&oacute;n del sistema ya esta lista para ser comercializada, 
  a trav&eacute;s de las pruebas que hemos comentado. Esto supone un gran trabajo 
  que involucra a cientos (si no miles) de programadores, betatesters, redactores 
  de documentaci&oacute;n y personal administrativo. Por supuesto, no todos los 
  fabricantes de UNIX trabajan as&iacute;, pero esto da una idea de la panor&aacute;mica 
  habitual.<br>
  </font><font color="#000000" size="2">Con Linux, hay que olvidarse del concepto 
  de desarrollo organizado, sistemas de control de versiones, informaci&oacute;n 
  de errores estructurada o an&aacute;lisis estad&iacute;sticos. Linux es un sistema 
  operativo hecho por "hackers"10 Linux ha sido desarrollado principalmente por 
  un grupo de programadores de todo el mundo unidos por Internet. A trav&eacute;s 
  de Internet, cualquiera tiene la oportunidad de unirse al grupo y ayudar al 
  desarrollo y depuraci&oacute;n del n&uacute;cleo, portar nuevo software, escribir 
  documentaci&oacute;n o ayudar a los nuevos usuarios. La comunidad de Linux se 
  comunica principalmente mediante diversas listas de correo y grupos de USENET. 
  Existen algunos acuerdos en el desarrollo, como que cualquiera que desee que 
  su c&oacute;digo sea incluido en la versi&oacute;n "oficial" del n&uacute;cleo 
  deber&aacute; ponerse en contacto con Linus Torvalds, quien comprobara el c&oacute;digo 
  y lo incluir&aacute; en el n&uacute;cleo. Por lo general, estar&aacute; encantado 
  en hacerlo, siempre que no estropee otras cosas.<br>
  </font><font color="#000000" size="2">El sistema se ha dise&ntilde;ado siguiendo 
  una filosof&iacute;a abierta y de crecimiento. Por regla general hay una nueva 
  versi&oacute;n del n&uacute;cleo cada dos meses (a veces cada menos tiempo)11 
  Esto depende del n&uacute;mero de errores a corregir, la cantidad de informaci&oacute;n 
  recibida de los usuarios, y lo que haya dormido Linus esta semana.<br>
  </font><font color="#000000" size="2">Por 
  lo tanto, es dif&iacute;cil decir que todos los errores hayan sido corregidos 
  en cierta fecha. Pero conforme el sistema va apareciendo libre de errores cr&iacute;ticos 
  o manifiestos, se considera "estable" y se lanzan nuevas revisiones. Hay que 
  recordar que no se pretende realizar un sistema perfecto, sin errores. Simplemente, 
  se pretende desarrollar una implementaci&oacute;n gratuita de UNIX. Linux esta 
  hecho para desarrolladores, mas que para otro tipo de personas.</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">10 Por "hacker" queremos referirnos a programadores 
  fervientemente dedicados, por hobby, a explotar sus ordenadores al m&aacute;ximo, 
  con resultados &uacute;tiles para otras personas. Este concepto es contrario 
  al habitualmente aceptado, que dice que un "hacker" es un pirata inform&aacute;tico.</font></P>
<P><font color="#000000" size="2">11 N. del T.: Actualmente nos consta la aparici&oacute;n 
  semanal de al menos una revisi&oacute;n de las versiones experimentales.</font></P>
<P><font color="#000000" size="2">Si alguien desarrolla una aplicaci&oacute;n 
  o nueva caracter&iacute;stica para el n&uacute;cleo, se a&ntilde;ade inicialmente 
  en una etapa "alfa", es decir, pensada ser probada por usuarios atrevidos que 
  aceptan los fallos que tenga. Dado que la comunidad de Linux se basa sobre todo 
  en Internet, el software "alfa" es enviado, normalmente, a servidores FTP dedicados 
  a Linux (vea el ap&eacute;ndice C) y anunciado mediante un mensaje puesto en 
  un grupo USENET dedicado a Linux. Los usuarios que se llevan el software lo 
  prueban e informan sobre errores o sugerencias al autor por correo electr&oacute;nico.<br>
  </font><font color="#000000" size="2">Una vez que se corrigen los problemas 
  iniciales, el c&oacute;digo pasa a una etapa "beta", en la que se considera 
  estable pero incompleto (o sea, funciona, pero no incluye todas las funcionalidades 
  previstas). Tambi&eacute;n se puede pasar a una etapa "final" en la que el software 
  se considera terminado.<br>
  </font><font color="#000000" size="2">Para el c&oacute;digo del n&uacute;cleo, 
  una vez que se ha terminado, el desarrollador puede pedir a Linus que lo incluya 
  en el n&uacute;cleo est&aacute;ndar, o bien que lo ponga como c&oacute;digo 
  optativo.<br>
  </font><font color="#000000" size="2">Recordar que lo anterior son solo convenciones, 
  y no leyes. Algunos programas pueden no necesitar fases "alpha". Es el desarrollador 
  quien tomara las decisiones al respecto.<br>
  </font><font color="#000000" size="2">Estar&aacute; sorprendido de que un grupo 
  de programadores y aficionados voluntarios, relativamente desorganizados, hayan 
  podido hacer algo. Sin embargo, este grupo constituye uno de los mas eficientes 
  y motivados. Todo el n&uacute;cleo de Linux ha sido escrito de la nada, sin 
  emplear ning&uacute;n c&oacute;digo de fuentes propietarias. Todo el software, 
  librer&iacute;as, sistemas de ficheros y drivers han sido desarrollados o portados 
  desde otros sistemas; y se han programado drivers para los dispositivos mas 
  populares.<br>
  </font><font color="#000000" size="2">Normalmente, Linux es distribuido junto 
  con otro software en lo que se conoce como distribuci&oacute;n, que es un paquete 
  de software que permite poner a punto un sistema completo. Dado que es dif&iacute;cil 
  para los usuarios noveles el crear un sistema UNIX partiendo del n&uacute;cleo 
  y programas de diversas fuentes, se crearon las distribuciones con el fin de 
  facilitar esta tarea: con la distribuci&oacute;n, usted solo tiene que coger 
  el CD-ROM o los disquetes e instalar para tener un sistema completo con programas 
  de aplicaci&oacute;n incluidos. Como es de esperar, no hay ninguna distribuci&oacute;n 
  "est&aacute;ndar". Hay muchas, cada una con sus ventajas y desventajas. Hablaremos 
  mas sobre distribuciones en la secci&oacute;n 2.1.<br>
  </font><font color="#000000" size="2">A pesar de lo anterior, necesitara cierto 
  conocimiento de UNIX para poder instalar y usar un sistema completo. No hay 
  distribuci&oacute;n que no tenga fallos, por lo que requerir&aacute; de su habilidad 
  al teclado para corregir los peque&ntilde;os problemas que se presenten. Ejecutar 
  un sistema UNIX no es f&aacute;cil, ni siquiera en las versiones comerciales. 
  Hay que andarse con cuidado en cualquier UNIX, y Linux no es una excepci&oacute;n.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.6.1"></a>1.6.1 Consejos 
  para novatos en UNIX: </font><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.6">Anterior</a>- 
  <a href="#1.6.2">Siguiente </a>- <a href="#indice">&Iacute;ndice</a> </font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><b><u><font size="2"><br>
  </font></u></b></font></font></u></b></font></font></u></b></font></u></font></u></font></P>
<P><font color="#000000" size="2">Instalar y utilizar su propio sistema Linux 
  no requiere grandes conocimientos de UNIX. De hecho, muchos novatos de UNIX 
  instalan con &eacute;xito sus sistemas. Es una experiencia de la que se aprende, 
  pero de la que se pueden generar frustraciones. Si tiene suerte, podr&aacute; 
  instalar y usar Linux sin conocimiento alguno de UNIX. Sin embargo, cuando quiera 
  introducirse en tareas mas complejas (instalar nuevo software, recompilar el 
  n&uacute;cleo, etc.) el conocimiento de UNIX empieza a ser necesario.<br>
  </font><font color="#000000" size="2">Por suerte, ejecutando su propio sistema 
  Linux podr&aacute; aprender las cosas esenciales de UNIX para llevar a cabo 
  esas tareas. Este libro contiene informaci&oacute;n que intentara ayudarle (vea 
  el capitulo 3, que es un tutorial sobre UNIX; y el capitulo 4, que le ense&ntilde;ara 
  cosas sobre la administraci&oacute;n de Linux). Quiz&aacute;s le parezca interesante 
  leer esos cap&iacute;tulos antes de instalar Linux. En este caso, se ahorrara 
  algunos problemas.<br>
  </font><font color="#000000" size="2">Nadie puede esperar hacerse experto administrador 
  de la noche a la ma&ntilde;ana. No hay implementaci&oacute;n alguna que este 
  libre de mantenimiento. Por lo tanto, prep&aacute;rese si es novato, pero no 
  se desespere ante los problemas. El que escribe esto12 tampoco tenia mucha idea 
  antes de empezar.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.6.2"></a>1.6.2 Consejos 
  para los gurus: </font><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><br>
  <font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.6.1">Anterior</a>- 
  <a href="#1.7">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font> 
  <font size="2"><br>
  </font><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.6.1"><br>
  </a></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font><font color="#000000" size="2">La 
  gente con a&ntilde;os de experiencia programando y administrando sistemas UNIX 
  tambi&eacute;n puede necesitar ayuda al querer instalar Linux. Existen aspectos 
  con los que los magos del UNIX tendr&aacute;n que familiarizarse antes de entrar 
  en materia. Por un lado, Linux no es un sistema UNIX comercial.<br>
  No intenta seguir exactamente el mismo est&aacute;ndar de otros sistemas. En 
  otras palabras, este factor no es el &uacute;nico factor que interesa en el 
  desarrollo de Linux.<br>
  Es mas importante, sin embargo, su funcionalidad. En muchos casos, el nuevo 
  c&oacute;digo introducido en el n&uacute;cleo aun tendr&aacute; errores o estar&aacute; 
  incompleto. Se acepta que es mas importante lanzar el c&oacute;digo cuanto antes 
  para que los usuarios lo puedan probar. Por ejemplo, el emulador WINE (emulador 
  de Microsoft Windows para Linux) tiene una versi&oacute;n alfa "oficial" mientras 
  la prueban los usuarios.<br>
  En este sentido, la comunidad de Linux tiene derecho a trabajar con este c&oacute;digo, 
  probarlo y ayudar a su desarrollo. Los UNIX comerciales, raramente siguen esta 
  pol&iacute;tica.<br>
  Si ha sido administrador de UNIX durante mas de diez a&ntilde;os, y ha usado 
  diferentes sistemas comerciales, vera que este sistema es muy moderno y din&aacute;mico. 
  Se crea un nuevo n&uacute;cleo cada dos meses aproximadamente. Se lanza nuevo 
  software permanentemente. Un d&iacute;a puede creer que su sistema esta a la 
  ultima, y al d&iacute;a siguiente creer que esta en la Edad de Piedra.<br>
  Con toda esta actividad din&aacute;mica, ¿como puede mantenerse al d&iacute;a? 
  La mayor parte de las veces, es mejor actualizarse el software de manera incremental; 
  o sea, actualizar aquellas partes del sistema que necesita actualizar. Por ejemplo, 
  si nunca va a usar Emacs, no hay motivo para que se actualice continuamente 
  ese programa. Incluso siendo usuario de Emacs, no hay necesidad de actualizarlo 
  cada vez, a menos que haya alguna caracter&iacute;stica nueva que le interese. 
  No hay raz&oacute;n para estar siempre cambi&aacute;ndose las versiones del 
  software.<br>
  Esperamos que Linux satisfaga sus expectativas de un sistema UNIX. El coraz&oacute;n 
  de Linux alberga el esp&iacute;ritu del software gratuito y el desarrollo constante. 
  La comunidad de Linux favorece su expansi&oacute;n, y es dif&iacute;cil creer 
  en su fiabilidad, especialmente cuando se procede del UNIX comercial.<br>
  Tampoco puede esperarse que Linux sea perfecto, ya que no lo es ning&uacute;n 
  otro software. Sin embargo, creemos que Linux es tan &uacute;til y completo 
  como cualquier otra implementaci&oacute;n de UNIX.</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">12 N. del T.: al igual que el que lo traduce</font></P>
<P><font color="#000000"><b><u><font size="2"><a name="1.7"></a><font size="3">1.7 
  Diferencias Entre Linux y Otros Sistemas Operativos: </font><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.6.2">Anterior</a>- 
  <a href="#1.7.1">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></font></u></font><font size="2"></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></font></u></b></font></P>
<P><font color="#000000" size="2">Es importante entender las diferencias entre 
  Linux y otros sistemas operativos, tales como MS-DOS, OS/2, y otras implementaciones 
  de UNIX para ordenador personal. Antes de nada, conviene aclarar que Linux puede 
  convivir felizmente con otros sistemas operativos en la misma maquina: es decir, 
  Ud. puede correr MS-DOS y OS/2 en compa&ntilde;&iacute;a de Linux sobre el mismo 
  sistema sin problemas.<br>
  </font><font color="#000000" size="2">Hay incluso formas de interactuar entre 
  los diversos sistemas operativos como veremos.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.7.1"></a>1.7.1 ¿Por que 
  usar Linux?: </font><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.7">Anterior</a>- 
  <a href="#1.7.2">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></P>
<P><font color="#000000" size="2">¿Por que usar Linux en lugar de un sistema operativo 
  comercial conocido, bien probado, y bien documentado? Podr&iacute;amos darle 
  miles de razones. Una de las mas importantes es, sin embargo, que Linux es una 
  excelente elecci&oacute;n para trabajar con UNIX a nivel personal. Si Ud. es 
  un desarrollador de software UNIX, ¿por que usar MS-DOS en casa? Linux le permitir&aacute; 
  desarrollar y probar el software UNIX en su PC, incluyendo aplicaciones de bases 
  de datos y X Window. Si es Ud. estudiante, la oportunidad esta en que los sistemas 
  de su universidad correr&aacute;n UNIX. Con Linux, podr&aacute; correr su propio 
  sistema UNIX y adaptarlo a sus necesidades. La instalaci&oacute;n y uso de Linux 
  es tambi&eacute;n una excelente manera de aprender UNIX si no tiene acceso a 
  otras maquinas UNIX.<br>
  </font><font color="#000000" size="2">Pero no perdamos la vista. Linux no es 
  solo para los usuarios personales de UNIX. Es robusto y suficientemente completo 
  para manejar grandes tareas, as&iacute; como necesidades de computo distribuidas. 
  Muchos negocios especialmente los peque&ntilde;os se est&aacute;n cambiando 
  a Linux en lugar de otros entornos de estaci&oacute;n de trabajo basados en 
  UNIX. Las universidades encuentran a Linux perfecto para dar cursos de dise&ntilde;o 
  de sistemas operativos. Grandes vendedores de software comercial se est&aacute;n 
  dando cuenta de las oportunidades que puede brindar un sistema operativo gratuito.<br>
  </font><font color="#000000" size="2">Las siguientes secciones deber&iacute;an 
  destacar las diferencias mas importantes entre Linux y otros sistemas operativos. 
  Esperamos que encuentre que Linux puede cubrir sus necesidades, o (al menos) 
  mejorar su entorno actual de trabajo. Tenga en mente que la mejor manera de 
  saborear Linux es simplemente prob&aacute;ndolo, ni siquiera necesita instalar 
  un sistema completo para tener una muestra de &eacute;l. En el Capitulo 2, le 
  mostramos como.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.7.2"></a>1.7.2 Linux vs. 
  MS-DOS: </font><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.7.1">Anterior</a>- 
  <a href="#1.7.3">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></P>
<P><font color="#000000" size="2">No es raro tener ambos, Linux y MS-DOS, en el 
  mismo sistema. Muchos usuarios de Linux conf&iacute;an en MS-DOS para aplicaciones 
  tales como procesadores de texto. Aunque Linux proporciona sus propios an&aacute;logos 
  para estas aplicaciones (por ejemplo, TEX), existen varias razones por las que 
  un usuario concreto desear&iacute;a correr tanto MS-DOS como Linux. Si toda 
  su tesis esta escrita en WordPerfect13 para MS-DOS, puede no ser capaz de convertirla 
  f&aacute;cilmente a TEX o alg&uacute;n otro formato. Hay muchas aplicaciones 
  comerciales para MS-DOS que no est&aacute;n disponibles para Linux, y no hay 
  ninguna raz&oacute;n por la que no pueda usar ambos.<br>
  </font><font color="#000000" size="2">Como 
  puede saber, MS-DOS no utiliza completamente la funcionalidad de los procesadores 
  80386 y 80486. Por otro lado, Linux corre completamente en el modo protegido 
  del procesador y explota todas las caracter&iacute;sticas del este. Puede acceder 
  directamente a toda su memoria disponible (e incluso mas all&aacute; de la disponible, 
  usando RAM virtual). Linux proporciona un interface UNIX completo no disponible 
  bajo MS-DOS, el desarrollo y adaptaci&oacute;n de aplicaciones UNIX bajo Linux 
  es cosa f&aacute;cil, mientras que, bajo MS-DOS, Ud. esta limitado a un peque&ntilde;o 
  subgrupo de la funcionalidad de programaci&oacute;n UNIX. Al ser Linux un verdadero 
  sistema UNIX, Ud. no tendr&aacute; estas limitaciones.</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">13 N. del T.: El ejemplo del autor se ha quedado 
  obsoleto: Ya existe un WordPerfect 6.1 nativo para Linux</font></P>
<P><font color="#000000" size="2">Podr&iacute;amos debatir los pros y contras 
  de MS-DOS y Linux durante paginas y paginas. Sin embargo, baste decir que Linux 
  y MS-DOS son entidades completamente diferentes. MS-DOS no es caro (comparado 
  con otros sistemas operativos comerciales), y tiene un fuerte asentamiento en 
  el mundo de los PC's. Ning&uacute;n otro sistema operativo para PC ha conseguido 
  el nivel de popularidad de MS-DOS b&aacute;sicamente porque el coste de esos 
  otros sistemas operativos es inaccesible para la mayor&iacute;a de los usuarios 
  de PC's. Muy pocos usuarios de PC pueden imaginar gastarse 100000 ptas. o mas 
  solamente en el sistema operativo. Linux, sin embargo, es gratis, y por fin 
  tiene la oportunidad de decidirse.<br>
  </font><font color="#000000" size="2">Le permitiremos emitir sus propios juicios 
  de Linux y MS-DOS basados en sus expectativas y necesidades. Linux no esta destinado 
  a todo el mundo. Si siempre ha querido tener un sistema UNIX completo en casa, 
  si es alto el coste de otras implementaciones UNIX para PC, Linux puede ser 
  lo que estaba buscando.<br>
  </font><font color="#000000" size="2">Se dispone de herramientas que permiten 
  interactuar entre Linux y MS-DOS. Por ejemplo, es f&aacute;cil acceder a los 
  ficheros MS-DOS desde Linux. Tambi&eacute;n hay disponible un emulador de MS-DOS, 
  que permite ejecutar muchas aplicaciones populares de MS-DOS. Actualmente se 
  esta desarrollando un emulador de Microsoft Windows.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.7.3"></a>1.7.3 Linux vs. 
  Otros Sistemas Operativos: </font><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><br>
  </font><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.7.2">Anterior</a>- 
  <a href="#1.7.4">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font><font color="#000000" size="2"><br>
  </font></font></u></font><font color="#000000" size="2"><u> </u></font></font></u></font><font size="2"></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></P>
<P><font color="#000000" size="2">Est&aacute;n surgiendo un gran numero de sistemas 
  operativos avanzados en el mundo del PC. Concretamente, OS/2 de IBM y Windows 
  NT de Microsoft comienzan a tener popularidad a medida que los usuarios de MS-DOS 
  migran a ellos.<br>
  </font><font color="#000000" size="2">Ambos, OS/2 y Windows NT son sistemas 
  operativos completamente multitarea, muy parecidos a Linux. T&eacute;cnicamente, 
  OS/2, Windows NT y Linux son bastante similares: Soportan aproximadamente las 
  mismas caracter&iacute;sticas en t&eacute;rminos de interfaz de usuario, redes, 
  seguridad, y dem&aacute;s. Sin embargo, la diferencia real entre Linux y los 
  otros es el hecho de que Linux es una versi&oacute;n de UNIX, y por ello se 
  beneficia de las contribuciones de la comunidad UNIX en pleno.<br>
  </font><font color="#000000" size="2">¿Que hace a UNIX tan importante? No solo 
  es el sistema operativo mas popular para maquinas multiusuario, tambi&eacute;n 
  es la base de la mayor&iacute;a del mundo del software de libre distribuci&oacute;n. 
  Si tiene acceso a Internet, casi todo el software de libre distribuci&oacute;n 
  disponible esta espec&iacute;ficamente escrito para sistemas UNIX. (Internet 
  en si esta profundamente basada en UNIX.)<br>
  </font><font color="#000000" size="2">Hay muchas implementaciones de UNIX, de 
  muchos vendedores, y ni una sola organizaci&oacute;n es responsable de su distribuci&oacute;n. 
  Hay un gran pulso en la comunidad UNIX por la estandarizaci&oacute;n en forma 
  de sistemas abiertos, pero ninguna corporaci&oacute;n controla este dise&ntilde;o. 
  Por eso, ning&uacute;n vendedor (o, como parece, ning&uacute;n hacker) puede 
  adoptar estos est&aacute;ndares en una implementaci&oacute;n de UNIX.<br>
  </font><font color="#000000" size="2">Por otro lado, OS/2 y Windows NT son sistemas 
  propietarios. El interface y dise&ntilde;o est&aacute;n controlados por una 
  sola corporaci&oacute;n, y solo esa corporaci&oacute;n puede implementar ese 
  dise&ntilde;o. (No espere encontrar una versi&oacute;n gratis de OS/2 en un 
  futuro cercano.) De alguna forma, este tipo de organizaci&oacute;n es beneficiosa: 
  establece un est&aacute;ndar estricto para la programaci&oacute;n y el interfaz 
  de usuario distinto al encontrado incluso en la comunidad de sistemas abiertos. 
  OS/2 es OS/2 vaya donde vaya lo mismo ocurre con Windows NT.<br>
  </font><font color="#000000" size="2">Sin embargo, el interface UNIX esta constantemente 
  desarroll&aacute;ndose y cambiando. Varias organizaciones est&aacute;n intentando 
  estandarizar el modelo de programaci&oacute;n, pero la tarea es muy dif&iacute;cil.<br>
  </font><font color="#000000" size="2">Linux, en particular, es en su mayor&iacute;a 
  compatible con el est&aacute;ndar POSIX.1 para el interface de programaci&oacute;n 
  UNIX. A medida que pase el tiempo, se espera que el sistema se adhiera a otros 
  est&aacute;ndares, pero la estandarizaci&oacute;n no es la etapa primaria en 
  la comunidad de desarrollo de Linux.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.7.4"></a>1.7.4 Otras implementaciones 
  de UNIX: </font><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.7.3">Anterior</a>- 
  <a href="#1.8">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font><font size="2"></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font><font size="2"><br>
  </font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></P>
<P><font color="#000000" size="2">Hay otras implementaciones de UNIX para el 80386 
  y 80486. La arquitectura 80386 se presta al dise&ntilde;o de UNIX y buen un 
  numero de vendedores han sacado ventaja de este factor.<br>
  </font><font color="#000000" size="2">Hablando de caracter&iacute;sticas, otras 
  implementaciones de UNIX para PC son bastante similares a Linux. Podr&aacute; 
  ver que casi todas las versiones comerciales de UNIX soportan b&aacute;sicamente 
  el mismo software, entorno de programaci&oacute;n, y caracter&iacute;sticas 
  de red. Sin embargo, hay algunas fuertes diferencias entre Linux y las versiones 
  comerciales de UNIX.<br>
  </font><font color="#000000" size="2">En primer lugar, Linux soporta un rango 
  de hardware diferente de las implementaciones comerciales. En general, Linux 
  soporta la mayor&iacute;a de dispositivos hardware conocidos, pero el soporte 
  esta aun limitado a ese hardware al que los desarrolladores tengan acceso actualmente. 
  Sin embargo, los vendedores de UNIX comercial por lo general tienen una base 
  de soporte mas amplia, y tienden a soportar mas hardware, aunque Linux no esta 
  tan lejos de ellos. Cubriremos los requerimientos hardware de Linux en la Secci&oacute;n 
  1.8.<br>
  </font><font color="#000000" size="2">En segundo, las implementaciones comerciales 
  de UNIX suelen venir acompa&ntilde;adas de un conjunto completo de documentaci&oacute;n, 
  as&iacute; como soporte de usuario por parte del vendedor. Por contra, la mayor&iacute;a 
  de documentaci&oacute;n para Linux se limita a documentos disponibles en Internet 
  y libros como este. En la Secci&oacute;n 1.9 se listan fuentes de documentaci&oacute;n 
  de Linux y otra informaci&oacute;n.<br>
  </font><font color="#000000" size="2">En lo que concierne a estabilidad y robustez, 
  muchos usuarios han comentado que Linux es al menos tan estable como los sistemas 
  UNIX comerciales. Linux esta aun en desarrollo, y algunas caracter&iacute;sticas 
  (como redes TCP/IP) son menos estables, pero mejora a medida que pasa el tiempo.<br>
  </font><font color="#000000" size="2">El factor mas importante a considerar 
  por muchos usuarios es el precio. El software de Linux es gratis, si tiene acceso 
  a Internet (o a otra red de ordenadores) y puede tra&eacute;rselo. Si no tiene 
  acceso a tales redes, tiene la opci&oacute;n de comprarlo pidi&eacute;ndolo 
  por correo en disquetes, cinta o CD-ROM (vea el Ap&eacute;ndice B). Por supuesto, 
  Ud. puede copiarse Linux de un amigo que puede tener ya el software, o compartir 
  el coste de comprarlo con alguien mas. Si planea instalar Linux en un gran numero 
  de maquinas, solo necesita comprar una copia del software. Linux no se distribuye 
  con licencia para "una sola maquina".<br>
  </font><font color="#000000" size="2">El valor de las implementaciones comerciales 
  de UNIX no deber&iacute;a ser rebajado: conjuntamente con el precio del software 
  en si, uno paga generalmente por la documentaci&oacute;n, el soporte, y una 
  etiqueta de calidad. Estos factores son muy importantes para grandes instituciones, 
  pero los usuarios de ordenadores personales pueden no necesitar esos beneficios. 
  En cualquier caso, muchos negocios y universidades encuentran que correr Linux 
  en un laboratorio con ordenadores baratos es preferible a correr una versi&oacute;n 
  comercial de UNIX en un laboratorio de estaciones de trabajo. Linux es capaz 
  de proporcionar la funcionalidad de una estaci&oacute;n de trabajo sobre hardware 
  de PC a una fracci&oacute;n de su coste.<br>
  </font><font color="#000000" size="2">Como un ejemplo del "mundo real" sobre 
  el uso de Linux dentro de la comunidad inform&aacute;tica, los sistemas Linux 
  han viajado hasta los grandes mares del Pacifico Norte, encarg&aacute;ndose 
  de las telecomunicaciones y an&aacute;lisis de datos para en un buque de investigaci&oacute;n 
  oceanogr&aacute;fica. Los sistemas Linux se est&aacute;n usando en estaciones 
  de investigaci&oacute;n en la Ant&aacute;rtida. Como ejemplo mas mundano, quiz&aacute;, 
  varios hospitales est&aacute;n usando Linux para mantener registros de pacientes. 
  Esta probando ser tan fiable y &uacute;til como otras implementaciones de UNIX.<br>
  </font><font color="#000000" size="2">Hay otras implementaciones gratuitas o 
  baratas de UNIX para el 386 y 486. Una de las mas conocidas es 386BSD, una implementaci&oacute;n 
  y adaptaci&oacute;n del UNIX BSD para el 386. 386BSD es comparable a Linux en 
  muchos aspectos, pero cual de ellos es "mejor" depende de las necesidades y 
  expectativas personales. La &uacute;nica distinci&oacute;n fuerte que se puede 
  hacer es que Linux se desarrolla abiertamente (donde cualquier voluntario puede 
  colaborar en el proceso de desarrollo), mientras 386BSD se desarrolla dentro 
  de un equipo cerrado de programadores que mantienen el sistema.<br>
  </font><font color="#000000" size="2">Debido a esto, existen diferencias filos&oacute;ficas 
  y de dise&ntilde;o serias entre los dos proyectos. Los objetivos de los dos 
  proyectos son completamente distintos: el objetivo de Linux es desarrollar un 
  sistema UNIX completo desde el desconocimiento (y divertirse mucho en el proceso), 
  y el objetivo de 386BSD es en parte modificar el c&oacute;digo de BSD existente 
  para usarlo en el 386.<br>
  </font><font color="#000000" size="2">NetBSD es otra adaptaci&oacute;n de la 
  distribuci&oacute;n NET/2 de BSD a un numero de maquinas, incluyendo el 386. 
  NetBSD tiene una estructura de desarrollo ligeramente mas abierta, y es comparable 
  al 386BSD en muchos aspectos.<br>
  </font><font color="#000000" size="2">Otro proyecto conocido es HURD, un esfuerzo 
  de la Free Software Foundation (Fundaci&oacute;n de Software gratuito) para 
  desarrollar y distribuir una versi&oacute;n gratis de UNIX para muchas plataformas. 
  Contacte con la Free Software Foundation (la direcci&oacute;n se da en el Ap&eacute;ndice 
  F) para obtener mas informaci&oacute;n sobre este proyecto. Al tiempo de escribir 
  este documento, HURD aun esta en los primeros pasos de su desarrollo.<br>
  </font><font color="#000000" size="2">Tambi&eacute;n existen otras versiones 
  baratas de UNIX, tales como Coherent (disponible por cerca de $99) y Minix (un 
  cl&oacute;nico de UNIX acad&eacute;mico, pero &uacute;til, en el que se basaron 
  los primeros pasos del desarrollo de Linux). Algunas de estas implementaciones 
  son de inter&eacute;s en mayor parte acad&eacute;mico, mientras otras son sistemas 
  ya maduros para productividad real. No hace falta decir, sin embargo, que muchos 
  usuarios de UNIX de PC se est&aacute;n pasando a Linux.</font></P>
<P><font color="#000000"><b><u><font size="2"><a name="1.8"></a><font size="3">1.8 
  Requerimientos de Hardware: </font><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.7.4">Anterior</a>- 
  <a href="#1.8.1">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font><font size="2"></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></P>
<P><font color="#000000" size="2">Ahora debe estar convencido de lo maravilloso 
  que es Linux y de las estupendas cosas que puede hacer por usted. Sin embargo, 
  antes de que se precipite e instale el software, tiene que asegurarse de los 
  requerimientos y limitaciones de hardware de Linux.<br>
  </font><font color="#000000" size="2">Tenga en cuenta que Linux fue desarrollado 
  por sus usuarios. Esto significa, en la mayor&iacute;a de las ocasiones, que 
  el hardware soportado por Linux es &uacute;nicamente aquel al que usuarios y 
  desarrolladores tienen realmente acceso. Seg&uacute;n van apareciendo, se van 
  soportando la mayor parte del hardware y los perif&eacute;ricos populares para 
  sistemas 80386/80486 (de hecho, Linux soporta mas hardware que algunas implementaciones 
  comerciales de UNIX). Sin embargo, aun no son reconocidos algunos de los perif&eacute;ricos 
  mas oscuros y esot&eacute;ricos. Seg&uacute;n pasa el tiempo aumenta el hardware 
  soportado por Linux, de manera que si sus perif&eacute;ricos favoritos no est&aacute;n 
  aqu&iacute; listados, hay gran probabilidad de que sean soportados pr&oacute;ximamente.<br>
  </font><font color="#000000" size="2">Otro inconveniente en el soporte de hardware 
  bajo Linux es que muchas compa&ntilde;&iacute;as han decidido conservar las 
  especificaciones del interfaz de su hardware como propietario. Como consecuencia 
  de esto, los desarrolladores voluntarios de Linux simplemente no pueden escribir 
  controladores (drivers) para esos perif&eacute;ricos (y si pudieran, tales controladores 
  serian propiedad de la compa&ntilde;&iacute;a due&ntilde;a del interfaz, lo 
  cual violar&iacute;a el GPL). Las compa&ntilde;&iacute;as que mantienen interfaces 
  propietarios, escriben sus propios controladores para sistemas operativos como 
  MS-DOS y Microsoft Windows; el usuario final (es decir, usted) no necesita saber 
  nada del interfaz. Desafortunadamente, esto impide a los desarrolladores de 
  Linux escribir controladores para esos perif&eacute;ricos.<br>
  </font><font color="#000000" size="2">Hay muy poco que hacer en esta tesitura. 
  En algunos casos, los programadores han intentado escribir controladores "clonados" 
  bas&aacute;ndose en asunciones acerca del interfaz. En otras ocasiones, los 
  desarrolladores trabajaran con la compa&ntilde;&iacute;a en cuesti&oacute;n 
  e intentaran obtener informaci&oacute;n del interfaz del perif&eacute;rico con 
  un nivel de &eacute;xito que puede variar.<br>
  </font><font color="#000000" size="2">En las siguientes secciones, trataremos 
  de resumir los requerimientos hardware para Linux. El documento Hardware HOWTO 
  (ver Secci&oacute;n 1.9) contiene un listado mas completo del hardware soportado 
  por Linux.<br>
  </font><font color="#000000" size="2">Aclaraci&oacute;n: un buen tratado acerca 
  del hardware soportado por Linux, esta actualmente en fase de desarrollo. Algunas 
  distribuciones puede que soporten, o no, estas caracter&iacute;sticas experimentales. 
  Esta secci&oacute;n lista en primer lugar el hardware que ya lleva cierto tiempo 
  soportado y del que se sabe de su estabilidad. En caso de duda, consulte la 
  documentaci&oacute;n de la distribuci&oacute;n de Linux que esta usando (ver 
  Secci&oacute;n 2.1 para mas informaci&oacute;n acerca de las distribuciones 
  de Linux).</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.8.1"></a>1.8.1 Requisitos 
  de Placa Base y de CPU: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.8">Anterior</a>- 
  <a href="#1.8.2">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">Actualmente Linux soporta sistemas con una CPU 
  Intel14 80386, 80486, o Pentium. Esto incluye todas las variantes del tipo de 
  CPU, como el 386SX, 486SX, 486DX, y 486DX2. Los "cl&oacute;nicos" no Intel, 
  como AMD y Cyrix tambi&eacute;n funcionan con Linux.<br>
  </font><font color="#000000" size="2">Si tiene un 80386 o 80486SX, puede que 
  tambi&eacute;n quiera aprovechar el coprocesador matem&aacute;tico, si bien 
  no es imprescindible (el n&uacute;cleo de Linux puede emular el coprocesador 
  si no cuenta con uno).<br>
  </font><font color="#000000" size="2">Est&aacute;n soportados todos los copros 
  est&aacute;ndar, tales como los IIT, Cyrix FasMath, e Intel. La placa base debe 
  ser de arquitectura ISA o EISA en cuanto a bus se refiere. Estos t&eacute;rminos 
  definen como interact&uacute;a el sistema con los perif&eacute;ricos y otros 
  componentes por medio del bus principal. La mayor&iacute;a de los sistemas vendidos 
  hoy son de bus ISA o EISA. El bus MicroChannel (MCA), que se encuentra en maquinas 
  como los IBM/PS2 no esta soportado actualmente.<br>
  </font><font color="#000000" size="2">Los 
  sistemas que usan arquitectura de bus local (para accesos mas r&aacute;pidos 
  en v&iacute;deo y disco) tambi&eacute;n est&aacute;n soportados. Es recomendable 
  que tenga una arquitectura de bus local est&aacute;ndar como pueda ser el Bus 
  Local VESA15("VLB").</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">14 N. del T.: Linux ya soporta, en la actualidad 
  a otras arquitecturas tales como ALPHA, Amiga, PowerPC, etc.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.8.2"></a>1.8.2 Requisitos 
  de memoria: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.8.1">Anterior</a>- 
  <a href="#1.8.3">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">Linux, comparado con otros sistemas operativos 
  avanzados, necesita muy poca memoria para funcionar . Deber&iacute;a contar 
  con un m&iacute;nimo de 2 megabytes de RAM; sin embargo, es altamente recomendable 
  tener 4 megabytes. Cuanta mas memoria tenga mas r&aacute;pido ira su sistema.<br>
  </font><font color="#000000" size="2">Linux soporta el rango completo de direcciones 
  de 32-bits de los 386/486; es decir, utilizara toda la memoria RAM de forma 
  autom&aacute;tica, y se apa&ntilde;ara sin problemas con tan solo 4 megabytes 
  de RAM, incluyendo aplicaciones "pedig&uuml;e&ntilde;as" como X-Window, Emacs, 
  y dem&aacute;s. Sin embargo, disponer de mas memoria es casi tan importante 
  como tener un procesador mas r&aacute;pido. 8 megabytes es mas que suficiente 
  para uso personal; 16 megabytes o mas pueden ser necesarios si espera una fuerte 
  carga de usuarios en el sistema.<br>
  </font><font color="#000000" size="2">La mayor&iacute;a de los usuarios de Linux, 
  reservan una parte del disco duro para espacio de intercambio ("swapping") que 
  se usa como RAM virtual. Incluso si dispone de bastante memoria RAM f&iacute;sica 
  en su maquina, puede que quiera utilizar un &aacute;rea de "swap" . El &aacute;rea 
  de "swap" no puede reemplazar a una memoria f&iacute;sica RAM real, pero puede 
  permitir a su sistema ejecutar aplicaciones mas grandes guardando en disco duro 
  aquellas partes de c&oacute;digo que est&aacute;n inactivas. La cantidad de 
  espacio de intercambio a reservar depende de diversos factores; volveremos a 
  esta cuesti&oacute;n en la Secci&oacute;n 2.2.3.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.8.3"></a>1.8.3 Requisitos 
  de la controladora de disco duro: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.8.2">Anterior</a>- 
  <a href="#1.8.4">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">No necesita un disco duro para ejecutar Linux; 
  puede ejecutar un sistema m&iacute;nimo completamente desde disquete. Sin embargo, 
  resulta lento y muy limitado, y de todas formas, muchos usuarios tienen acceso 
  a almacenamiento en disco duro. Debe tener una controladora AT-estandar (16-bit). 
  El n&uacute;cleo soporta controladoras XT-estandar (8 bit); aunque la mayor&iacute;a 
  de las controladoras usadas hoy son AT-estandar. Linux deber&iacute;a soportar 
  todas las controladoras MFM, RLL, e IDE. La mayor&iacute;a, pero no todas, las 
  controladoras ESDI est&aacute;n soportadas solo aquellas que hacen emulaci&oacute;n 
  hardware de la ST506.<br>
  </font><font color="#000000" size="2">La regla general para controladoras que 
  no sean SCSI, es que si puede acceder a las unidades (disco y/o disquete) desde 
  MS-DOS u otro sistema operativo, deber&iacute;a poder hacerlo desde Linux.<br>
  </font><font color="#000000" size="2">Linux 
  tambi&eacute;n soporta un numero de controladoras de disco SCSI, si bien el 
  soporte para SCSI es mas limitado a causa de la gran cantidad de est&aacute;ndares 
  que existen para el interfaz de las controladoras. Las controladoras SCSI soportadas16 
  incluyen las Adaptec AHA1542B, AHA1542C, AHA1742A (versi&oacute;n de BIOS 1.34), 
  AHA1522, AHA1740, AHA1740 (controladora SCSI-2, BIOS 1.34 en modo mejorado); 
  Future Domain 1680, TMC-850, TMC-950; Seagate ST-02; UltraStor SCSI; Western 
  Digital WD7000FASST. Las controladoras cl&oacute;nicas basadas en estas tarjetas 
  tambi&eacute;n deber&iacute;an funcionar.</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">15 N. del T.: PCI tambi&eacute;n esta soportado<br>
  </font><font color="#000000" size="2">16 
  N. del T.: Ver la secci&oacute;n 1.9 sobre como conseguir el fichero Hardware 
  HOWTO que contendr&aacute; una lista mas actualizada y completa</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.8.4"></a>1.8.4 Requisitos 
  de espacio en disco: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.8.3">Anterior</a>- 
  <a href="#1.8.5">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">Efectivamente, para instalar Linux, necesitara 
  tener algo de espacio libre en su disco duro. Linux soporta m&uacute;ltiples 
  discos duros en la misma maquina; puede disponer de espacio para Linux en m&uacute;ltiples 
  unidades si es necesario.<br>
  </font><font color="#000000" size="2">La cantidad de espacio en disco duro que 
  necesitara depende en gran medida de sus necesidades y de la cantidad de software 
  que va a instalar. Linux es relativamente peque&ntilde;o en relaci&oacute;n 
  a las implementaciones de UNIX; usted podr&iacute;a correr un sistema completo 
  con 10-20 megabytes de espacio en disco. Sin embargo, si quiere disponer de 
  espacio para expansiones, y para paquetes mas grandes como X-Window, necesitara 
  mas espacio. Si planea permitir a m&uacute;ltiples usuarios utilizar la maquina, 
  tendr&aacute; que dejar espacio para sus ficheros.<br>
  </font><font color="#000000" size="2">Tambi&eacute;n, a menos que tenga un mont&oacute;n 
  de memoria RAM f&iacute;sica (16 megabytes o mas), necesitara crear espacio 
  de intercambio ("swap"), para ser usado como RAM virtual. Comentaremos todos 
  estos detalles acerca de la instalaci&oacute;n y uso del espacio de intercambio 
  en la Secci&oacute;n 2.2.3.<br>
  </font><font color="#000000" size="2">Cada distribuci&oacute;n de Linux normalmente 
  viene con alg&uacute;n que otro texto que deber&iacute;a ayudarle a estimar 
  la cantidad precisa de espacio a reservar en funci&oacute;n del software que 
  planee instalar. Puede ejecutar un sistema m&iacute;nimo con menos de 20 megabytes; 
  un sistema completo con toda la parafernalia en 80 megabytes o menos; y un sistema 
  grande con sitio para muchos usuarios y espacio para futuras expansiones en 
  un rango de 100-150 megabytes. De nuevo, estas cifras son meramente orientativas; 
  usted tendr&aacute; que decidir, seg&uacute;n sus necesidades y objetivos, los 
  requerimientos espec&iacute;ficos de almacenamiento para su sistema.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.8.5"></a>1.8.5 Requisitos 
  de monitor y adaptador de v&iacute;deo: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.8.4">Anterior</a>- 
  <a href="#1.8.6">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">Linux soporta todas las tarjetas de v&iacute;deo 
  est&aacute;ndar Hercules, CGA, EGA, VGA, IBM monocromo, y Super VGA as&iacute; 
  como monitores para el interfaz por defecto basado en texto. En general, si 
  la combinaci&oacute;n que tiene de monitor y tarjeta de v&iacute;deo funcionan 
  bajo otro sistema operativo como MS-DOS, deber&iacute;a funcionar perfectamente 
  con Linux. La genuinas tarjetas CGA de IBM sufren el (d)efecto nieve ("snow") 
  bajo Linux, por lo que no es muy recomendable su uso.<br>
  </font><font color="#000000" size="2">Los entornos gr&aacute;ficos como el Sistema 
  X Window tienen requerimientos propios de hardware para la tarjeta de v&iacute;deo. 
  En vez de listar estos requerimientos aqu&iacute;, los trataremos en la Secci&oacute;n 
  5.1.1.<br>
  </font><font color="#000000" size="2">De forma breve, para ejecutar el Sistema 
  X Window en su maquina Linux, necesitara alguna de las tarjetas de v&iacute;deo 
  listadas en esa secci&oacute;n.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.8.6"></a>1.8.6 Hardware 
  diverso: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.8.5">Anterior</a>- 
  <a href="#1.8.7">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">Las secciones de arriba describ&iacute;an que 
  hardware es necesario para correr un sistema Linux. Sin embargo, la mayor&iacute;a 
  de los usuarios tienen cierto numero de dispositivos "opcionales" como almacenamiento 
  en cintas y CD-ROM, tarjetas de sonido y dem&aacute;s, y est&aacute;n interesados 
  en saber si este hardware esta, o no es, soportado por Linux. Siga leyendo.</font></P>
<P><font color="#000000"><i><font size="2">1.8.6.1 Ratones y otros dispositivos 
  apuntadores</font></i></font></P>
<P><font color="#000000" size="2">Normalmente usted solo usara un rat&oacute;n 
  bajo un entorno gr&aacute;fico como el Sistema X Window. Sin embargo, algunas 
  aplicaciones Linux no asociadas con un entorno gr&aacute;fico, hacen uso del 
  rat&oacute;n.<br>
  </font><font color="#000000" size="2">Linux soporta todos los ratones serie 
  est&aacute;ndar, incluyendo Logitech, MM series, Mouseman, Microsoft (2 botones) 
  y Mouse Systems (3 botones). Linux tambi&eacute;n soporta los ratones de bus 
  Microsoft, Logitech, y ATIXL. El interfaz de rat&oacute;n de PS/2 tambi&eacute;n 
  es soportado.<br>
  </font><font color="#000000" size="2">Todos los dem&aacute;s dispositivos apuntadores, 
  como los "trackball" que emulen a los dispositivos de arriba, tambi&eacute;n 
  deber&iacute;an funcionar.</font></P>
<P><font color="#000000"><i><font size="2">1.8.6.2 Almacenamiento en CD-ROM</font></i></font></P>
<P><font color="#000000" size="2">Casi todas las unidades de CD-ROM usan el interfaz 
  SCSI17. Siempre y cuando tenga un adaptador SCSI soportado por Linux, su unidad 
  de CD-ROM deber&iacute;a funcionar. Hay un numero de unidades de CD-ROM que 
  se ha comprobado funcionan bajo Linux, incluyendo el NEC CDR-74, Sony CDU-541, 
  y Texel DM-3024. Las unidades internas Sony CDU-31a y Mitsumi tambi&eacute;n 
  est&aacute;n soportadas por Linux. Linux soporta el sistema de ficheros est&aacute;ndar 
  para CD-ROMs ISO-9660.</font></P>
<P><font color="#000000"><i><font size="2">1.8.6.3 Unidades de cinta</font></i></font></P>
<P><font color="#000000" size="2">Hay varios tipos de unidades de cinta disponibles 
  en el mercado. La mayor&iacute;a usan el interfaz SCSI, por lo que estar&iacute;an 
  soportadas por Linux. Entre las unidades de cinta SCSI verificadas est&aacute;n 
  la Sankyo CP150SE; Tandberg 3600; Wangtek 5525ES, 5150ES, y 5099EN con el adaptador 
  PC36.<br>
  </font><font color="#000000" size="2">Otras unidades QIC-02 deber&iacute;an 
  estar soportadas tambi&eacute;n.<br>
  </font><font color="#000000" size="2">Existen controladores en fase de desarrollo 
  para varios otros dispositivos de cinta como las unidades Colorado que se conectan 
  a la controladora de disquetes.</font></P>
<P><font color="#000000"><i><font size="2">1.8.6.4 Impresoras</font></i></font></P>
<P><font color="#000000" size="2">Linux soporta todas las impresoras paralelo. 
  Si puede acceder a su impresora por el puerto paralelo desde MS-DOS, u otro 
  sistema operativo, deber&iacute;a poder acceder a el desde Linux tambi&eacute;n. 
  El software de impresi&oacute;n de Linux consiste en el software est&aacute;ndar 
  de UNIX lp y lpr. Este software tambi&eacute;n le permite imprimir remotamente 
  a trav&eacute;s de la red, si es que tiene una disponible.</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">17 N. del T.: El parque de CD-ROMs ha cambiado 
  de forma asombrosa en los &uacute;ltimos meses. Sirva decir que Linux soporta, 
  adem&aacute;s de las citadas en el p&aacute;rrafo, los nuevos est&aacute;ndares 
  ATAPI para CD-ROMs conectables a controladoras IDE</font></P>
<P><font color="#000000"><i><font size="2">1.8.6.5 M&oacute;dems</font></i></font></P>
<P><font color="#000000" size="2">Igual que para las impresoras, Linux soporta 
  toda la gama de m&oacute;dems serie, tanto internos como externos. Hay una gran 
  cantidad de software de telecomunicaciones disponible para Linux, incluyendo 
  Kermit, pcomm, minicom, Seyon. Si su m&oacute;dem es accesible desde otro sistema 
  operativo en la misma maquina, deber&iacute;a poder acceder a el sin dificultad 
  desde Linux.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.8.7"></a>1.8.7 Tarjetas 
  Ethernet: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.8.6">Anterior</a>- 
  <a href="#1.9">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">Linux soporta un buen numero de tarjetas Ethernet 
  y adaptadores para LAN18. Esto incluye los siguientes:</font></P>
<DIR> 
  <DIR> 
    <P><font size="2" color="#000000"><B>o</b> 3com 3c503, 3c503/16<br>
      </font><font size="2" color="#000000"><B>o</b> Novell NE1000, NE2000<br>
      </font><font size="2" color="#000000"><B>o</b> Western Digital WD8003, WD8013<br>
      </font><font size="2" color="#000000"><B>o</b> Hewlett Packard HP27245, 
      HP27247, HP27250<br>
      </font><font size="2" color="#000000"><B>o</b> D-Link DE-600</font></P>
  </DIR>
</DIR>
<P><font color="#000000" size="2">Los siguientes cl&oacute;nicos se ha informado 
  que funcionan:</font></P>
<DIR> 
  <DIR> 
    <P><font size="2" color="#000000"><B>o</b> LANNET LEC-45<br>
      </font><font size="2" color="#000000"><B>o</b> Alta Combo<br>
      </font><font size="2" color="#000000"><B>o</b> Artisoft LANtastic AE-2<br>
      </font><font size="2" color="#000000"><B>o</b> Asante Etherpak 2001/2003,<br>
      </font><font size="2" color="#000000"><B>o</b> D-Link Ethernet II<br>
      </font><font size="2" color="#000000"><B>o</b> LTC E-NET/16 P/N 8300-200-002<br>
      </font><font size="2" color="#000000"><B>o</b> Network Solutions HE-203,<br>
      </font><font size="2" color="#000000"><B>o</b> SVEC 4 Dimension Ethernet<br>
      </font><font size="2" color="#000000"><B>o</b> 
      4-Dimension FD0490 EtherBoard 16</font></P>
  </DIR>
</DIR>
<P><font color="#000000" size="2">Aquellas tarjetas cl&oacute;nicas compatibles 
  con cualquiera de las tarjetas anteriores tambi&eacute;n deber&iacute;a funcionar.</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">18 N. del T.: Algunas tarjetas token-ring ya 
  est&aacute;n soportadas</font></P>
<P><font color="#000000"><b><u><font size="2"><a name="1.9"></a><font size="3">1.9 
  Fuentes de informaci&oacute;n sobre Linux: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.8.7">Anterior</a>- 
  <a href="#1.9.1">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></font></u></font><font size="2"></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></font></u></b></font></P>
<P><font color="#000000" size="2">Como podr&aacute; imaginar, adem&aacute;s de 
  este libro, hay muchas otras fuentes de informaci&oacute;n sobre Linux. Concretamente, 
  hay numerosos libros sobre UNIX en general, que recomendamos a aquellos lectores 
  que no tengan experiencia previa con UNIX. Si somos nuevos en UNIX, lo mas indicado 
  es leer uno de estos libros antes de meternos en la "peligrosa selva" de Linux. 
  Un buen comienzo puede ser el libro Learning the UNIX Operating System, de Grace 
  Todino y John Strang.<br>
  </font><font color="#000000" size="2">Casi todas las fuentes de informaci&oacute;n 
  sobre Linux est&aacute;n disponibles principalmente de forma electr&oacute;nica. 
  Esto es, deber&aacute; tener acceso a una red, como Internet, USENET o Fidonet, 
  con el fin de obtener la documentaci&oacute;n. Si no tiene acceso a ninguna 
  red, siempre puede encontrar la forma de obtener copias impresas en disquetes 
  o CDROM de los libros.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.9.1"></a>1.9.1 Documentaci&oacute;n 
  On-Line: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.9">Anterior</a>- 
  <a href="#1.9.2">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">Si tiene acceso a Internet, encontrara variada 
  documentaci&oacute;n en muchos servidores de FTP del mundo. Si no tiene acceso 
  directo a Internet, aun puede obtener los documentos: muchos distribuidores 
  de Linux en CDROM incluyen toda o casi toda la documentaci&oacute;n existente 
  en la red. Adem&aacute;s, se suelen distribuir por redes diferentes como Fidonet 
  o Compuserve. Y si tiene acceso &uacute;nicamente al correo en Internet, puede 
  obtener ficheros de servidores FTP sin mas que usar un servidor de ftpmail. 
  Vea el ap&eacute;ndice C para mas informaci&oacute;n.<br>
  </font><font color="#000000" size="2">Hay gran cantidad de servidores FTP que 
  distribuyen software y documentaci&oacute;n de Linux. En el ap&eacute;ndice 
  C encontrara una lista con servidores conocidos. Con el fin de reducir el trafico 
  de red, deber&iacute;a utilizar el servidor que le quede mas cercano19 geogr&aacute;ficamente.<br>
  </font><font color="#000000" size="2">El ap&eacute;ndice A incluye una lista 
  de algunos de los documentos sobre Linux que se encuentran disponibles por FTP 
  an&oacute;nimo. Los nombres de los ficheros pueden no ser los mismos en todos 
  los servidores, pero suelen estar en el directorio docs dentro del directorio 
  que dediquen a Linux. Por ejemplo, en sunsite.unc.edu los ficheros de Linux 
  est&aacute;n en /pub/Linux y la documentaci&oacute;n en /pub/Linux/docs.<br>
  </font><font color="#000000" size="2">Algunos documentos que puede encontrar 
  son las Linux FAQ, una colecci&oacute;n de FAQ sobre Linux; los documentos HOWTO, 
  dedicados a aspectos espec&iacute;ficos, como la instalaci&oacute;n inicial 
  (Installation HOWTO) o la configuraci&oacute;n de impresoras y spoolers (Printing 
  HOWTO).<br>
  </font><font color="#000000" size="2">Algunos documentos se env&iacute;an regularmente 
  a uno o mas grupos USENET sobre Linux. No deje de leer la secci&oacute;n 1.9.4 
  sobre el tema de las News.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.9.2"></a>1.9.2 Linux en 
  el WWW: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.9.1">Anterior</a>- 
  <a href="#1.9.3">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">La pagina inicial de la documentaci&oacute;n 
  de Linux en el Web se encuentra en la direcci&oacute;n URL</font></P>
<P><font color="#000000"><A HREF="http://sunsite.unc.edu/mdw/linux.html"><B>http://sunsite.unc.edu/mdw/linux.html</B></A></font></P>
<P><font color="#000000" size="2">Desde esta p&aacute;gina puede accederse a los 
  HOWTOs y otros documentos en formato HTML. Tambi&eacute;n se encuentran enlaces 
  a otros servidores de inter&eacute;s.</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">19 N. del T.: Vea el ap&eacute;ndice E.1 para 
  localizar una lista de ftps espa&ntilde;oles</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.9.3"></a>1.9.3 Libros y 
  otras publicaciones: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.9.2">Anterior</a>- 
  <a href="#1.9.4">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">En este momento, hay algunos trabajos publicados 
  sobre Linux. Principalmente, los libros del Proyecto de Documentaci&oacute;n 
  de Linux (LDP), que se lleva a cabo mediante Internet para escribir y distribuir 
  una colecci&oacute;n de manuales para Linux. Estos manuales son an&aacute;logos 
  a los que se publican junto con versiones comerciales de UNIX: tratan la instalaci&oacute;n 
  y puesta en marcha, programaci&oacute;n, trabajo en red, asuntos del n&uacute;cleo 
  y muchas cosas mas.<br>
  </font><font color="#000000" size="2">Los manuales del LDP se encuentran disponibles 
  mediante FTP an&oacute;nimo en el Internet, as&iacute; como por correo a trav&eacute;s 
  de algunos comercios. En el ap&eacute;ndice A se enumeran los manuales disponibles 
  y como conseguirlos.<br>
  </font><font color="#000000" size="2">No hay muchos mas libros que traten el 
  tema particular de Linux. Sin embargo, si que hay numerosos libros sobre UNIX 
  en general que normalmente son aplicables a Linux, como aquellos sobre como 
  utilizar o programar sobre el sistema UNIX, ya que Linux no difiere mucho en 
  su interfaz con el usuario o programador. En resumen, lo que quiera saber sobre 
  el uso y programaci&oacute;n de Linux lo encontrara en los libros sobre UNIX. 
  Encontrara los nombres de algunos de estos libros en el ap&eacute;ndice A.<br>
  </font><font color="#000000" size="2">Con los libros escritos para Linux y los 
  que hay sobre UNIX se debe estar ya suficientemente documentado como para hacer 
  cualquier cosa sobre su sistema Linux.<br>
  </font><font color="#000000" size="2">Tambi&eacute;n existe un magazine mensual 
  sobre Linux, el Linux Journal. Se distribuye por todo el mundo y es una excelente 
  manera de mantenerse al d&iacute;a en este tema, sobre todo si no se tiene acceso 
  a USENET. En el ap&eacute;ndice A encontrara informaci&oacute;n sobre como suscribirse 
  a esta publicaci&oacute;n.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.9.4"></a>1.9.4 Grupos de 
  NEWS USENET: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.9.3">Anterior</a>- 
  <a href="#1.9.5">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font></P>
<P><font color="#000000"><u><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"> 
  <font color="#000000" size="2"><u> </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font><font color="#000000" size="2">"USENET" 
  es un foro mundial de art&iacute;culos electr&oacute;nicos organizado en "grupos", 
  o sea, &aacute;reas de discusiones relacionadas con cada tema concreto. Buena 
  parte del desarrollo de Linux ha sido a trav&eacute;s de Internet y USENET, 
  con lo que no es extra&ntilde;o que existan bastantes grupos que traten el tema.<br>
  </font><font color="#000000" size="2">Inicialmente, el grupo sobre Linux era 
  alt.os.linux, y se cre&oacute; para tratar aqu&iacute; las cuestiones que sobre 
  Linux abundaban ya en comp.os.minix y varias listas de correo. El trafico en 
  el grupo de Linux fue creciendo lo suficiente como para permitirse el paso a 
  la jerarqu&iacute;a comp, en Febrero de 1992.<br>
  </font><font color="#000000" size="2">comp.os.linux se ha convertido en un grupo 
  de News muy conocido, mas que cualquiera otro de comp.os. En Diciembre del 92 
  se vot&oacute; la creaci&oacute;n del grupo comp.os.linux.announce para </font><font color="#000000" size="2">reducir 
  el trafico de comp.os.linux. En Julio de 1993 se parti&oacute; este grupo de 
  forma definitiva en la jerarqu&iacute;a que hoy existe.<br>
  </font><font color="#000000" size="2">Si no tiene acceso a USENET, pero si puede 
  usar el correo electr&oacute;nico, existen pasarelas de correo a News disponibles 
  para cada uno de los grupos siguientes.</font></P>
<UL>
  <LI><font color="#000000" size="2">comp.os.linux.announce</font></LI>
</UL>
<P><font color="#000000" size="2">comp.os.linux.announce es un grupo moderado, 
  pensado para anuncios importantes respecto a Linux (como informes sobre errores 
  detectados, lanzamiento de parches, etc). Si quiere leer grupos de Linux, empiece 
  por este. Los art&iacute;culos que aqu&iacute; se publican no son reenviados 
  a ning&uacute;n otro grupo normalmente. En el se pueden encontrar adem&aacute;s 
  muchos art&iacute;culos que se env&iacute;an peri&oacute;dicamente, incluyendo 
  documentos ya mencionados como los HOWTOs.<br>
  </font><font size="2" color="#000000">Los env&iacute;os al grupo deben ser aceptados 
  por los moderadores, Matt Welsh y Lars Wirzenius. Si quiere enviar algo, normalmente 
  basta con que lo ordene a su software de News. Este software se ocupara de enviar 
  el articulo a los moderadores para que lo acepten. Sin embargo, si su sistema 
  no esta correctamente configurado, puede enviarlo directamente a la direcci&oacute;n 
  de correo </font><font color="#000000"><A HREF="mailto:linux-announce@tc.cornell.edu"><B>linux-announce@tc.cornell.edu</B></A><FONT SIZE=2>.<br>
  </font></font><font color="#000000" size="2">Los 
  restantes grupos sobre Linux no est&aacute;n moderados.</font></P>
<UL>
  <LI><font color="#000000" size="2">comp.os.linux.help</font></LI>
</UL>
<P><font color="#000000" size="2">Es el grupo mas popular. Contiene preguntas 
  y respuestas sobre la instalaci&oacute;n o ejecuci&oacute;n de los sistemas 
  Linux. Si tiene problemas con Linux, puede usar este grupo y recibir&aacute; 
  respuesta de quien pueda ayudarle. Sin embargo, se recomienda que lea antes 
  la documentaci&oacute;n por si ah&iacute; encuentra la ayuda necesaria. </font></P>
<UL>
  <LI><font color="#000000" size="2">comp.os.linux.admin</font></LI>
</UL>
<P><font color="#000000" size="2">En este grupo se discuten temas relacionados 
  con la administraci&oacute;n del sistema Linux como entorno multiusuario. Aqu&iacute; 
  son bienvenidos los comentarios y preguntas sobre software de empaquetado, de 
  backups, o sobre la gesti&oacute;n de cuentas de usuarios.</font></P>
<UL>
  <LI><font color="#000000" size="2">comp.os.linux.development</font></LI>
</UL>
<P><font color="#000000" size="2">En este grupo se discuten asuntos relacionados 
  con el desarrollo en el n&uacute;cleo de Linux. Por ejemplo, si esta escribiendo 
  un driver nuevo y necesita consejo sobre alg&uacute;n aspecto, es aqu&iacute; 
  donde deber&aacute; preguntar. Adem&aacute;s, es aqu&iacute; donde se discuten 
  los objetivos en el desarrollo de Linux, tal y como se dice en la secci&oacute;n 
  1.6.<br>
  </font><font color="#000000" size="2">Debe observarse que este grupo no 
  esta pensado para tratar el desarrollo de software para Linux, sino el desarrollo 
  del propio Linux. Estos temas deben tratarse en otro grupo.</font></P>
<UL>
  <LI><font color="#000000" size="2">comp.os.linux.misc</font></LI>
</UL>
<P><font color="#000000" size="2">Aqu&iacute; se mantienen debates que no encajen 
  en los grupos anteriores. Concretamente, las t&iacute;picas guerras "Linux vs. 
  Windows 95" o cualquier articulo de car&aacute;cter no t&eacute;cnico.<br>
  </font><font color="#000000" size="2">El grupo comp.os.linux sigue existiendo, 
  pero se recomienda usar los nuevos grupos. Si no tiene acceso a ellos, hable 
  con su administrador de las News.</font></P>
<P><font color="#000000"><u><font size="2"><a name="1.9.5"></a>1.9.5 Listas de 
  correo en Internet: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.9.4">Anterior</a>- 
  <a href="#1.10">Siguiente </a>- <a href="#indice">&Iacute;ndice</a></font></font></u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></u></font></P>
<P><font color="#000000" size="2">Si tiene acceso al correo electr&oacute;nico 
  de Internet, puede aun participar en las listas de correo aunque no tenga acceso 
  a USENET. A estas listas de correo puede apuntarse incluso sin tener acceso 
  alguno a Internet, gracias a las pasarelas que ofrecen otros servicios, como 
  UUCP, FidoNET o CompuServe.<br>
  </font><font color="#000000" size="2">La lista de correo de "Activistas del 
  Linux" 20 esta pensada principalmente para desarrolladores y gente interesada 
  en participar en el desarrollo. Es una lista "multicanal", en la que puede apuntarse 
  a uno o mas "canales" seg&uacute;n los temas que le interesen. Entre estos canales 
  se encuentran el NORMAL, el KERNEL, el GCC (sobre el compilador de GNU), el 
  NET o el DOC (sobre el tema de la documentaci&oacute;n de Linux).<br>
  </font><font color="#000000" size="2">Para 
  mas informaci&oacute;n sobre esta lista de correo, env&iacute;e un mensaje a</font></P>
<P><font color="#000000"><A HREF="mailto:linux-activists@niksula.hut.fi"><B>linux-activists@niksula.hut.fi</B></A></font></P>
<P><font color="#000000" size="2">Recibir&aacute; una lista de canales disponibles 
  e informaci&oacute;n de como apuntarse o borrarse de estos.<br>
  </font><font color="#000000" size="2">Existen otras listas de correo de prop&oacute;sito 
  especial. El mejor camino para encontrarlas es leer los anuncios aparecidos 
  en USENET, y la lista de "mailing-list" disponible peri&oacute;dicamente en 
  el grupo </font><font color="#000000" size="2">news.answers.</font></P>
<P><font color="#000000"><b><u><font size="2"><a name="1.10"></a><font size="3">1.10 
  Como obtener ayuda: </font><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></font></u></b><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000" size="2"><a href="#1.9.5">Anterior</a>- 
  Siguiente - <a href="#indice">&Iacute;ndice</a></font></font></u></font><font color="#000000" size="2"><u> 
  </u></font></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></font></u></font><font size="2"></font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></font></u><b><u><font size="2"><font color="#000000"><b><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><font color="#000000"><u><font size="2"><br>
  </font></u></font></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></font></u></font></u></font></u></font></u></font></font></u></b></font></font></u></b></font></P>
<P><font color="#000000" size="2">Indudablemente, necesitara cierta ayuda durante 
  sus primeras aventuras en el mundo de Linux. Aqu&iacute; veremos algunas indicaciones 
  sobre como obtener esa ayuda.<br>
  </font><font color="#000000" size="2">La forma mas inmediata de buscar ayuda 
  es mediante las listas de correo y grupos de USENET que se mantienen en Internet, 
  tal como explicamos en la secci&oacute;n 1.9. Si no tiene acceso a Internet, 
  puede encontrar ayuda en otros servicios on-line como los BBS's o Compuserve.<br>
  </font><font color="#000000" size="2">Tambi&eacute;n hay ciertas empresas que 
  han empezado a dar soporte comercial de Linux. Esto le permitir&aacute; pedir 
  ayuda a los t&eacute;cnicos a cambio del pago de una cuota. El ap&eacute;ndice 
  B contiene una lista de comerciantes de Linux, alguno de los cuales ofrece soporte 
  t&eacute;cnico. Sin embargo, si tiene acceso a USENET y al correo de Internet, 
  vera que puede obtener soporte t&eacute;cnico de calidad y gratuito.<br>
  </font><font color="#000000" size="2">Lo que sigue son sugerencias que le hacemos 
  para mejorar su experiencia con Linux y garantizarle mayor probabilidad de &eacute;xito 
  para encontrar soluciones a los problemas que se le presenten.<br>
  </font><font color="#000000" size="2">- Consultar primero toda la documentaci&oacute;n 
  disponible<br>
  </font><font color="#000000" size="2">Lo primero que debe hacer cuando 
  encuentre un problema es leerse la documentaci&oacute;n que se lista en la secci&oacute;n 
  1.9 y el ap&eacute;ndice A. Estos documentos fueron laboriosamente escritos 
  para gente como usted, gente que necesitaba ayuda sobre Linux. Los libros sobre 
  Unix tambi&eacute;n se pueden usar para resolver dudas de Linux.<br>
  </font><font color="#000000" size="2">Frecuentemente, y por dif&iacute;cil que 
  parezca, se encuentran respuestas a muchos problemas.</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">20 N. del T.: Linux Activists</font></P>
<P><font color="#000000" size="2">Si se tiene acceso a las news de USENET o a 
  listas de correo relacionadas con Linux, se debe leer su contenido antes de 
  poner una pregunta sobre sus problemas. Muchas veces hay problemas comunes que 
  no se encuentran f&aacute;cilmente en los libros pero que tienen frecuente respuesta 
  en los grupos de USENET o similar. Enviar la pregunta a los grupos sin leerlos 
  antes puede ser una perdida de tiempo.<br>
  </font><font color="#000000" size="2">- Aprenda a apreciar las cosas hechas 
  por uno mismo.<br>
  </font><font color="#000000" size="2">En la mayor&iacute;a de los casos se recomienda 
  investigar por cuenta de uno mismo antes de pedir ayuda al exterior. Recuerde 
  que Linux no es un sistema comercial y puede hacer con el lo que quiera (modificarlo, 
  etc). Si aprende a hacerse las cosas por si mismo, su experiencia le permitir&aacute; 
  llegar a ser, tal vez, uno de los famosos "gurus" de Linux.<br>
  </font><font color="#000000" size="2">- Mantenga la calma.<br>
  </font><font color="#000000" size="2">Hay que evitar la desesperaci&oacute;n 
  a pesar de todos los problemas. No se ha o&iacute;do aun ninguna historia de 
  alguien que, en un ataque de ira, borrase todos sus discos de Linux con un fuerte 
  im&aacute;n.<br>
  </font><font color="#000000" size="2">Los mismos autores se han desahogado a 
  pu&ntilde;etazos con almohadas o similares en arrebatos de este tipo. Hay que 
  esperar un poco a que las distribuciones de Linux se hagan mas f&aacute;ciles 
  aun de instalar, aunque ya lo son mas que casi cualquier otro Unix comercial.<br>
  </font><font color="#000000" size="2">- Evite poner preguntas en USENET demasiado 
  pronto.<br>
  </font><font color="#000000" size="2">Mucha gente comete el error de pedir ayuda 
  en USENET demasiado pronto. Cuando encuentre alg&uacute;n problema, no se vaya 
  de inmediato al terminal mas cercano (insistimos, no lo haga) para escribir 
  su duda en un grupo de News de Linux. Es mejor que intente antes resolverlo 
  pues muchas veces es debido al nerviosismo inicial y se puede caer en el error 
  de preguntar cosas demasiado triviales. Vamos, que si su PC no se enciende, 
  mire antes a ver si esta enchufado.<br>
  </font><font color="#000000" size="2">- Si escribe su pregunta en USENET, haga 
  que merezca la pena.<br>
  </font><font color="#000000" size="2">Finalmente, puede que se vea obligado 
  a pedir ayuda a los foros dedicados a Linux, bien mediante listas de correo 
  o con USENET. Cuando redacte su pregunta, recuerde que la gente que va a leerla 
  no esta ah&iacute; para ayudarle. La Red no es un servicio posventa. As&iacute; 
  pues, hay que redactar el articulo de la forma mas completa posible.<br>
  </font><font color="#000000" size="2">¿C&oacute;mo puede conseguir esto? En 
  primer lugar, debe incluir toda la informaci&oacute;n acerca de su sistema y 
  el problema que crea relevante. Una escueta pregunta como "no puedo conseguir 
  que el correo electr&oacute;nico funcione" dif&iacute;cilmente ser&aacute; contestada, 
  a menos que incluya informaci&oacute;n acerca de su sistema, que software utiliza, 
  que ha intentado hacer para resolverlo y que resultados ha obtenido.<br>
  </font><font color="#000000" size="2">Adem&aacute;s, suele ser interesante a&ntilde;adir 
  informaci&oacute;n mas general, como que versi&oacute;n del sistema utiliza 
  (del n&uacute;cleo y distribuci&oacute;n), as&iacute; como un peque&ntilde;o 
  resumen de su hardware. Pero tampoco exagere incluyendo su tipo de monitor, 
  por ejemplo, cuando su problema sea con el software de red.<br>
  </font><font color="#000000" size="2">En segundo lugar, recuerde que necesita 
  intentar resolver por su cuenta el problema antes de recurrir a la Red. Si, 
  por ejemplo, nunca ha intentado instalarse el correo electr&oacute;nico, y pretende 
  que directamente le cuenten en la Red como se hace, estar&aacute; cometiendo 
  un gran error. Hay muchos documentos disponibles (vea la secci&oacute;n 1.9) 
  acerca de como iniciar la instalaci&oacute;n de paquetes de aplicaci&oacute;n 
  t&iacute;picos bajo Linux. La idea es hacer todo lo que pueda por si mismo y 
  solo entonces pedir ayuda si finalmente la necesita.<br>
  </font><font color="#000000" size="2">Recuerde tambi&eacute;n que la gente que 
  vea su mensaje, generalmente dispuesta a ayudarle, puede hartarse de ver la 
  misma pregunta una y otra vez. Observe las preguntas y respuestas que existen 
  en el grupo de News actualmente, pues muchas veces la soluci&oacute;n a su problema 
  ya esta en la Red antes de que lo pregunte.<br>
  </font><font color="#000000" size="2">Por 
  &uacute;ltimo sea conciso, en la medida de lo posible, a la hora de redactar 
  un articulo. Es mucho mas efectivo ser breve, directo e informativo al pedir 
  ayuda. No olvide la educaci&oacute;n. Son frecuentes las disputas en la Red 
  sin venir demasiado a cuento. La Red21 es un excelente medio para buscar ayuda 
  y para resolver sus problemas de Linux pero hay que saber utilizarla.</font></P>
<P><font color="#000000" size="2">_____________________________________________</font></P>
<P><font color="#000000" size="2">21 N. del T.: La Red se refiere a Internet, 
  como la red que engloba a todas las redes publicas de datos</font></P>
</BODY>
</HTML>
