<HTML>
<HEAD>
<TITLE>guidede</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#FFFFFF">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
<P><A HREF="guidec.htm"><IMG SRC="left.gif" BORDER=0 WIDTH=37 HEIGHT=34></A></TD>
<TD WIDTH="11%" VALIGN="TOP">
<P ALIGN="CENTER"><A HREF="guide.htm"><IMG SRC="up.gif" BORDER=0 WIDTH=34 HEIGHT=37></A></TD>
<TD WIDTH="43%" VALIGN="TOP">&nbsp;</TD>
</TR>
</TABLE>

<FONT FACE="Courier New" SIZE=2 COLOR="#000000"><P>&nbsp;</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Arial" SIZE=6 COLOR="#800000"><P ALIGN="CENTER">Ap&eacute;ndice D</P>
</B></U></FONT><P><HR></P>
<B><U><FONT FACE="Courier New" SIZE=2 COLOR="#008080"><P>¿Qu&eacute; es LuCAS?</P>
</B></U></FONT><FONT FACE="Courier New" SIZE=2 COLOR="#000000"><P>El proyecto LuCAS (Linux en CAStellano) comenz&oacute;, como tantas otras cosas ligadas a Linux, en un bar tomando cervezas (reales, no virtuales). Era all&aacute; por marzo de 1995 y ya se hab&iacute;a comentado en las &aacute;reas de FidoNet la necesidad de disponer de textos en castellano sobre Linux. Fue en aquel bar, el bar Ekin de Algorta (Bizkaia), donde nos reun&iacute;amos los usuarios de FidoNet todos los domingos, donde surgi&oacute; la idea de pasar a la acci&oacute;n. Tras discutirlo un poco, decidimos comenzar por traducir algo que fuese &uacute;til para aquellos que comenzaban a dar sus primeros pasos en linux, y cre&iacute;mos que el "Installation &amp; Getting Started" de Matt Welsh era el documento m&aacute;s adecuado. Como era mucho trabajo para una sola persona, y hab&iacute;a mucha gente que se hab&iacute;a mostrado dispuesta a colaborar, hab&iacute;a que hacerlo bien, y el trabajo de traducir un libro como &eacute;ste requer&iacute;a una labor de coordinaci&oacute;n que inmediatamente asumimos Ram&oacute;n Guti&eacute;rrez y yo, Alfonso Belloso. Yo me hice cargo de coordinar a los traductores para que no hiciesen trabajo repetido, y Ram&oacute;n se encargaba de juntar los trabajos y generar el documento final. Pedimos permiso al propio Matt Welsh, y as&iacute; echamos a andar.</P>
<P>Hubo que esperar un largo tiempo a tener una primera versi&oacute;n presentable del libro, pero se consigui&oacute;. Fundamentalmente, el hecho de que era una experiencia nueva, y la diversidad de gente que colabor&oacute;, hizo que este primer paso durase casi un a&ntilde;o, pero mereci&oacute; la pena esperar. Hay que decir que a pesar de que todo este movimiento surgi&oacute; de FidoNet, y que desde all&iacute; se sigue muy de cerca, al poco de comenzar a trabajar en ello fue cuando consegu&iacute; mi primera cuenta de Internet, y comprob&eacute; que la forma m&aacute;s pr&aacute;ctica de coordinarnos era a trav&eacute;s de La Red, ya que por Fidonet las comunicaciones se hac&iacute;an demasiado largas en el tiempo y no siempre eran seguras (para contactar con alg&uacute;n colaborador a veces se pod&iacute;a tardar 2 semanas, o no saber nada de &eacute;l jam&aacute;s). Y con ello comenzamos a disponer de m&aacute;s herramientas: primero un servidor de ftp, luego una lista de correo, un servidor de Web, y as&iacute; hasta hoy. Bueno, pues una vez terminado este primer libro nos qued&oacute; el gusanillo de hacer m&aacute;s, y visto que yo acab&eacute; un poco cansado, vino Juan Jos&eacute; Amor, me tom&oacute; el relevo y comenzamos a traducir la "Network Administrator Guide" de Olaf Kirch. Esta vez, y con la infraestructura ya montada, tardamos unos pocos meses en tener la primera versi&oacute;n.</P>
<P>Y despu&eacute;s de &eacute;ste ya se est&aacute;n haciendo m&aacute;s. Ya esta terminada la traducci&oacute;n de la "Linux User Guide" (en su fase alfa), y hay alg&uacute;n proyecto m&aacute;s en marcha. No quiero dejar de mencionar otros proyectos que trabajan en paralelo a &eacute;ste. LuCAS en s&iacute; se ha ido dedicando m&aacute;s a la labor de traducci&oacute;n de textos tipo libro, m&aacute;s concretamente a los del LDP, y creaciones propias, si bien en su origen se ide&oacute; para traducir cualquier tipo de documento e incluso para crear documentos directamente en castellano. El SLUG (Spanish Linux User Group) ya exist&iacute;a cuando surgi&oacute; LuCAS, o acababa de aparecer. Al amparo de LuCAS surgi&oacute; el INSFLUG, que se centra en la traducci&oacute;n/creaci&oacute;n de FAQs, HOWTOs y documentos m&aacute;s peque&ntilde;os. Y probablemente existan m&aacute;s grupos haciendo tareas similares, pero que ahora no conozco, ni soy capaz de recordar.</P>
<P>Para contactar con los coordinadores del grupo LuCAS, puede hacerlo con Alfonso Belloso Mart&iacute;nez &lt;</FONT><A HREF="mailto:alfon@bipv02.bi.ehu.es">alfon@bipv02.bi.ehu.es</A><FONT FACE="Courier New" SIZE=2 COLOR="#000000">&gt; o en &lt;</FONT><A HREF="mailto:alfon@iies.es">alfon@iies.es</A><FONT FACE="Courier New" SIZE=2 COLOR="#000000">&gt;; y con Juan Jos&eacute; Amor Iglesias &lt;</FONT><A HREF="mailto:jjamor@ls.fi.upm.es">jjamor@ls.fi.upm.es</A><FONT FACE="Courier New" SIZE=2 COLOR="#000000">&gt;.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Arial" SIZE=6 COLOR="#800000"><P ALIGN="CENTER"><A NAME="ape">Ap&eacute;ndice E</P>
</B></U></FONT><P></A><HR></P>
<FONT FACE="Courier New" SIZE=2 COLOR="#000000"><P>&nbsp;</P>
</FONT><B><U><FONT FACE="Courier New" SIZE=2 COLOR="#008080"><P>¿Qu&eacute; es INSFLUG?</P>
</B></U></FONT><FONT FACE="Courier New" SIZE=2 COLOR="#000000"><P>El INSFLUG naci&oacute; all&aacute; por marzo del '96, siendo su seno materno el &aacute;rea echomail de FidoNet R34.LINUX. Surge ante el entusiasmo de los que empez&aacute;bamos por aquel entonces a adentrarnos en el mundo del Linux, maravillados por como un SO tan potente, de distribuci&oacute;n libre, pod&iacute;a haberse hecho realidad gracias al buen hacer, generosidad e incre&iacute;ble colaboraci&oacute;n entre tantas personas "dispersas" por el globo. . .</P>
<P>Nos sentimos a&uacute;n m&aacute;s maravillados al observar la incre&iacute;ble participaci&oacute;n de la gente que frecuentaba el &aacute;rea, mod&eacute;lica en FidoNet, y por la inestimable ayuda que all&iacute; se prestaba; eso fue, (haciendo un poco de psic&oacute;logo) lo que produjo la formaci&oacute;n del INSFLUG, un inmenso y sincero agradecimiento, adem&aacute;s de enormes ganas de corresponder por nuestra parte, aportando nuestro granito de arena a la comunidad Linux en forma de traducciones de Howtos y FAQs, documentos que generalmente no superan la decena de p&aacute;ginas, y con cuya traducci&oacute;n adem&aacute;s de aportar, el novel o no tan novel, profundiza en el tema del que trate el Howto a medida que lo traduce, redundando en beneficio para &eacute;l mismo. . . ;-)</P>
<P>El INSFLUG se centra en la traducci&oacute;n de Howtos y FAQs (Frecuently Asked Questions, algo as&iacute; como Preguntas de Uso Frecuente, PUFs).</P>
<P>Para la traducci&oacute;n no necesitas m&aacute;s que un editor de texto (En Linux hay muchos) normal, y el paquete linuxdoc-sgml, con el que empleando un lenguaje muy sencillo, similar al HTML, una vez escrito un s&oacute;lo fuente, se podr&aacute;n obtener a partir de &eacute;l el documento en formatos *.dvi, *.ps, *.txt, *.lyx, *.rtf, *.info, *.html, etc..</P>
<P>Cuentas adem&aacute;s con una gu&iacute;a traducida del uso del linuxdoc-sgml en la que se a&ntilde;aden detalles de configuraci&oacute;n para el castellano, adem&aacute;s de la facilidad que supone el traducir editando el fuente original en ingl&eacute;s, ya que los c&oacute;digos, etc., ya est&aacute;n; no obstante, es un lenguaje sencill&iacute;simo, adem&aacute;s de ser el formato oficial de todos los Howtos.</P>
<P>El INSFLUG colabora estrechamente con LuCAS, es m&aacute;s, hay varias personas que colaboran con ambos grupos. El grupo LuCAS se dedica mayormente a las gu&iacute;as ("guides"), los libros m&aacute;s extensos del LDP o (Linux Documentation Project).</P>
<P>El coordinador de INSFLUG es Francisco J. Montilla (email: &lt;</FONT><A HREF="mailto:pacopepe@iname.com">pacopepe@iname.com</A><FONT FACE="Courier New" SIZE=2 COLOR="#000000">&gt;; irc: pukka; FiDO: 2:345/402.22). Si desea m&aacute;s informaci&oacute;n puede consultar su p&aacute;gina en WWW en &lt;</FONT><A HREF="http://www.insflug.nova.es/">http://www.insflug.nova.es</A><FONT FACE="Courier New" SIZE=2 COLOR="#000000">&gt; y su espacio de FTP en &lt;</FONT><A HREF="ftp://ftp.insflug.nova.es/">ftp://ftp.insflug.nova.es</A><FONT FACE="Courier New" SIZE=2 COLOR="#000000">&gt;.</P>
<P>&nbsp;</P>
</FONT><P>&nbsp;</P></BODY>
</HTML>
