<HTML>
<HEAD>
<TITLE>guide2</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#FFFFFF">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
<P><A HREF="guide01.htm"><IMG SRC="left.gif" BORDER=0 WIDTH=37 HEIGHT=34></A></TD>
<TD WIDTH="11%" VALIGN="TOP">
<P ALIGN="CENTER"><A HREF="guide.htm"><IMG SRC="up.gif" BORDER=0 WIDTH=34 HEIGHT=37></A></TD>
<TD WIDTH="43%" VALIGN="TOP">
<P ALIGN="RIGHT"><A HREF="guide03.htm"><IMG SRC="right.gif" BORDER=0 WIDTH=37 HEIGHT=34></A></TD>
</TR>
</TABLE>

<FONT FACE="Courier New" SIZE=2 COLOR="#000000"><P>&nbsp;</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Arial" SIZE=6 COLOR="#800000"><P ALIGN="CENTER">Cap&iacute;tulo 2</P>
</B></U></FONT><P><HR></P>
<FONT FACE="Courier New" SIZE=2 COLOR="#000000"><P>&nbsp;</P>
</FONT><B><U><FONT FACE="Courier New" SIZE=2 COLOR="#000080"><P>A prop&oacute;sito, ¿qu&eacute; es Unix?</P>
</B></U></FONT><FONT FACE="Courier New" SIZE=2 COLOR="#000000"><P>Ken Thompson tiene un autom&oacute;vil en cuyo proyecto de dise&ntilde;o trabaj&oacute;. A diferencia de otros autom&oacute;viles, &eacute;ste no tiene veloc&iacute;metro, nivel de combustible, ni ninguna de las est&uacute;pidas luces que importunan al conductor moderno. En su lugar, si el conductor comete alg&uacute;n error, se enciende un enorme "?" en el centro del tablero. "El conductor experimentado", dice, "sabr&aacute; usualmente que es lo que anda mal."</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Courier New" SIZE=2 COLOR="#008080"><P>2.1 La historia de Unix</P>
</B></U></FONT><FONT FACE="Courier New" SIZE=2 COLOR="#000000"><P>En 1965, los Bell Telephone Laboratories (Bell Labs, una divisi&oacute;n de AT&amp;T) estaba trabajando con General Electric y el Proyecto MAC del MIT para escribir un sistema operativo llamado Multics.</P>
<P>Para hacer m&aacute;s corta una historia de por s&iacute; larga, Bell Labs decidi&oacute; que el proyecto no estaba yendo a ninguna parte y disolvi&oacute; el grupo. Esto, sin embargo, dej&oacute; a la Bell sin un buen sistema operativo.</P>
<P>Ken Thompson y Dennis Ritchie decidieron esbozar un sistema operativo que supliera las necesidades de la Bell Labs. Cuando Thompson lleg&oacute; a necesitar un entorno de desarrollo (1970) que corriera en una PDP-7, aprovech&oacute; para poner en pr&aacute;ctica sus ideas. Brian Kernighan le di&oacute; el nombre de Unix como un juego de palabras contra Multics.</P>
<P>Un tiempo despu&eacute;s, Dennis Ritchie invent&oacute; el lenguaje de programaci&oacute;n "C". En 1973, se reescribi&oacute; el sistema operativo Unix en C, en lugar del ensamblador original1. En 1977, se movi&oacute; Unix a una nueva m&aacute;quina distinta de las PDP en las que hab&iacute;a corrido previamente, mediante un proceso que se denomina migraci&oacute;n. El hecho de que Unix estaba escrito en C facilit&oacute; la migraci&oacute;n, pues gran parte del c&oacute;digo ya escrito necesit&oacute; s&oacute;lo una simple recompilaci&oacute;n, y no una reescritura.</P>
<P>Al final de los '70, AT&amp;T ten&iacute;a prohibido competir en la industria de la computaci&oacute;n, por lo que otorg&oacute; licencias econ&oacute;micas de Unix a varios colegios y universidades. Unix se difundi&oacute; lentamente fuera de las instituciones acad&eacute;micas, pero pronto tambi&eacute;n se hizo popular en el &aacute;mbito comercial.</P>
<P>El Unix de la actualidad es distinto del Unix de 1970. Existen dos corrientes principales: System V, de los Unix System Laboratories (USL), que es una subsidiaria de Novell2, y BSD, Berkeley Software Distribution. La versi&oacute;n USL est&aacute; ahora por su cuarta versi&oacute;n, o SVR43, mientras que la &uacute;ltima BSD es la 4.4. Sin embargo, existen muchas diferentes versiones de Unix entre estas dos. La mayor&iacute;a de las versiones de Unix son desarrolladas por compa&ntilde;&iacute;as de software y derivan de uno de los dos agrupamientos. Las versiones que se utilizan actualmente incorporan caracter&iacute;sticas de ambas variaciones.</P>
<P>Las versiones actuales de Unix para PC Intel cuestan entre $500 y $2000.</P>
<P>_____________________________________________</P>
<P>1 "Lenguaje ensamblador" es un lenguaje de computadoras muy elemental, y que est&aacute; indisolublemente ligado a un tipo particular de ordenador.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Courier New" SIZE=2 COLOR="#008080"><P>2.2 La historia de Linux</P>
</B></U></FONT><FONT FACE="Courier New" SIZE=2 COLOR="#000000"><P>El autor primario de Linux es Linus Torvalds. A partir de la versi&oacute;n original, ha sido mejorado por incontables personas de todo el mundo. Se trata de un clon del sistema operativo Unix, escrito desde cero. Ni USL, ni la Universidad de California, Berkeley, tuvieron participaci&oacute;n en la escritura de Linux. Una de las cosas m&aacute;s interesantes de Linux es que el desarrollo ocurre simult&aacute;neamente alrededor del mundo. La gente ha contribu&iacute;do desde Australia a Finlandia y esperamos que lo siga haciendo.</P>
<P>Linux comenz&oacute; como un proyecto para explorar el chip 386. Uno de los primeros proyectos de Linus fue un programa que pueda alternar entre la impresi&oacute;n de AAAA y BBBB. Esto luego evolucion&oacute; hacia Linux.</P>
<P>Linux ha sido registrado bajo los t&eacute;rminos de la Licencia P&uacute;blica General GNU (GNU General Public License) o GPL. Esta licencia, escrita por la Free Software Foundation (FSF), est&aacute; dise&ntilde;ada para evitar que alguna persona restrinja la distribuci&oacute;n de software. En pocas palabras, dice que aunque Ud. cobre a alguien por entregarle una copia, no podr&aacute; impedir que ese alguien la regale. Tambi&eacute;n significa que debe estar disponible el c&oacute;digo fuente4. Esto es &uacute;til para los programadores.</P>
<P>Cualquiera puede modificar Linux y a&uacute;n distribuir sus modificaciones, siempre que mantenga el c&oacute;digo bajo la misma licencia.</P>
<P>En Linux puede correr la mayor&iacute;a del software popular en Unix, incluyendo el Sistema de Ventanas X. X se desarroll&oacute; en el Instituto Tecnol&oacute;gico Massachusetts, para permitir a los sistemas Unix la creaci&oacute;n de ventanas gr&aacute;ficas, y la c&oacute;moda interacci&oacute;n con las mismas. En la actualidad, el sistema X se usa en todas las versiones disponibles de Unix.</P>
<P>Adem&aacute;s de las dos variaciones de Unix, System V y BSD, existe un conjunto de documentos de estandarizaci&oacute;n publicados por la IEEE denominados POSIX. Linux antes que nada satisface los documentos POSIX-1 y POSIX-2. Su apariencia se asemeja mucho a la de BSD en ciertas partes, mientras que es parecido a System V en otras. Es una combinaci&oacute;n (y para la mayor&iacute;a de las personas, una buena) de los tres est&aacute;ndares.</P>
<P>Algunas de las utilidades inclu&iacute;das con las distribuciones de Linux proceden de la Free Software Foundation y son parte del proyecto GNU. El proyecto GNU es un esfuerzo para escribir un avanzado sistema operativo portable con el estilo de Unix. "Portable" significa que pueda correr en una variedad de m&aacute;quinas distintas, no s&oacute;lo en PCs Intel, Macintoshes, o lo que sea. El sistema operativo del Proyecto GNU se llama Hurd. La principal diferencia entre el Linux y el GNU Hurd no se encuentra en la interfaz del usuario, sino en la del programador, el Hurd es un sistema operativo moderno, mientras que Linux es m&aacute;s parecido al dise&ntilde;o original de Unix.</P>
<P>_____________________________________________</P>
<P>2 Recientemente vendida a Novell, antes era propiedad de AT&amp;T.</P>
<P>3 Una manera cr&iacute;ptica de decir "System five, Revision four".</P>
<P>4 El c&oacute;digo fuente de un programa es lo que el programador lee y escribe. Luego se traduce a un c&oacute;digo de m&aacute;quina ilegible para las personas, que es el que la computadora interpreta.</P>
<P>&nbsp;</P>
<P>La historia precedente de Linux olvida mencionar otra persona m&aacute;s all&aacute; de Linus Torvalds. Por ejemplo, H. J. Lu se ha ocupado de mantener gcc y la biblioteca C de Linux (dos elementos necesarios para todos los programas en Linux) casi desde el principio de la vida del sistema operativo. Ud. puede encontrar una lista de personas que merecen reconocimiento por su trabajo en cada sistema Linux, en el archivo /usr/src/linux/CREDITS.</P>
<P>&nbsp;</P>
</FONT><U><FONT FACE="Courier New" SIZE=2 COLOR="#808080"><P>2.2.1 Linux aqu&iacute; y ahora</P>
</U></FONT><FONT FACE="Courier New" SIZE=2 COLOR="#000000"><P>La primer cifra en el n&uacute;mero de versi&oacute;n de Linux indica revisiones realmente importantes en alcance.</P>
<P>Este n&uacute;mero cambia muy lentamente y para la &eacute;poca en que esto se escribe (febrero de 1996), s&oacute;lo est&aacute; disponible la versi&oacute;n 1.1.5. La segunda cifra indica revisiones de menor envergadura.</P>
<P>Los segundos n&uacute;meros cuando son pares representan versiones m&aacute;s estables, en las que uno puede confiar plenamente; cuando son impares indican versiones en desarrollo, que son m&aacute;s propensas a contener errores. La &uacute;ltima cifra es el n&uacute;mero menor de lanzamiento, cada vez que se libera una nueva versi&oacute;n, que tal vez s&oacute;lo arregla unos pocos problemas o agrega unas pocas caracter&iacute;sticas, se incrementa en uno este n&uacute;mero. En febrero de 1996, la &uacute;ltima versi&oacute;n estable es la 1.2.11, y la &uacute;ltima en desarrollo es la 1.3.61.</P>
<P>Linux es un sistema grande y desafortunadamente contiene errores que los desarrolladores reparan al encontrarlos. A&uacute;n cuando algunas personas puedan experimentar malfuncionamientos regularmente, esto se debe normalmente a causa de piezas de hardware que no son est&aacute;ndares o que est&aacute;n defectuosas; los errores6 que afectan a todos los usuarios son escasos y no se dan seguido.</P>
<P>Por supuesto, &eacute;sos son los errores del n&uacute;cleo. Los errores pueden presentarse en casi cada aspecto del sistema, y los usuarios de poca experiencia tienen problemas para diferenciar los distintos programas entre s&iacute;. Por ejemplo, cierto problema puede hacer que todos los caracteres aparezcan como un galimat&iacute;as, ¿es un error o una "caracter&iacute;stica"? Sorpresivamente es una caracter&iacute;stica, existen ciertas secuencias de control que al aparecer provocan el galimat&iacute;as. Espero que este libro le sea de ayuda para poder identificar esas situaciones.</P>
<P>&nbsp;</P>
</FONT><U><FONT FACE="Courier New" SIZE=2 COLOR="#808080"><P>2.2.2 Unas pocas preguntas y respuestas</P>
</U></FONT><FONT FACE="Courier New" SIZE=2 COLOR="#000000"><P>Antes de embarcarnos para nuestra larga traves&iacute;a, repasemos las cuestiones ultra-importantes.</P>
<U><P>Pregunta</U>: ¿C&oacute;mo se pronuncia Linux?</P>
<U><P>Respuesta</U>: De acuerdo con Linus, debe pronunciarse con un sonido corto ih, como prInt, mInImal, etc. Linux debe rimar con Minix, que es otro clon de Unix. No debe pronunciarse como la pronunciaci&oacute;n (americana) de "Peanuts" en Linus, sino m&aacute;s bien como "LIH-nucks". Y la u es cortante, como en "rule", no suave como en "ducks". Linux debe al menos rimar con "cynics". </P>
<P>_____________________________________________</P>
<P>5 N. del T.: La traducci&oacute;n se hace en febrero de 1997, y ya la versi&oacute;n "2" es cosa de todos los d&iacute;as.</P>
<P>6 N. del T.: error del ingl&eacute;s bug.</P>
<P>&nbsp;</P>
<U><P>Pregunta</U>: ¿Por qu&eacute; trabajar en Linux?</P>
<U><P>Respuesta</U>: ¿Por qu&eacute; no? Linux es generalmente m&aacute;s barato que los otros sistemas operativos (o al menos no m&aacute;s caro) y con frecuencia es menos problem&aacute;tico que algunos sistemas comerciales. Puede que no sea el mejor sistema para sus aplicaciones en particular, pero para alguien que est&aacute; interesado en utilizar las aplicaciones Unix disponibles para Linux, se trata de un sistema de alta "performance".</P>
<P>&nbsp;</P>
</FONT><U><FONT FACE="Courier New" SIZE=2 COLOR="#808080"><P>2.2.3 Software comercial en Linux</P>
</U></FONT><FONT FACE="Courier New" SIZE=2 COLOR="#000000"><P>Existe un mont&oacute;n de software comercial disponible para Linux. Comenzando con Motif, que es una interfaz para el sistema X Window que vagamente nos recuerda a Microsoft Windows, Linux tiene cada vez m&aacute;s software comercial. En estos tiempos, Ud. puede adquirir cualquier cosa, desde WordPerfect (el popular procesador de palabras) hasta Maple, que es un paquete que realiza complejas manipulaciones simb&oacute;licas, para Linux.</P>
<P>Para aquellos lectores interesados en las cuestiones legales, esto est&aacute; permitido por la licencia de Linux. A la vez que la licencia GNU General Public License (que se reproduce en el Ap&eacute;ndice B) cubre el n&uacute;cleo de Linux, la licencia GNU Library General Public License (que se puede ver en el Ap&eacute;ndice C) cubre la mayor parte del c&oacute;digo del cual dependen las aplicaciones. Esto permite que los proveedores de software comercial puedan vender sus aplicaciones y reservarse el c&oacute;digo fuente de las mismas.</P>
<P>Debe Ud. percatarse de que los dos documentos antes nombrados son notificaciones de derechos de autor. Ellos no regulan como utiliza Ud. el software, solamente indican bajo cuales circunstancias Ud. puede copiar dicho software, o sus productos derivados. Para la Free Software Foundation, &eacute;sta es una distinci&oacute;n muy importante: Linux no involucra ninguna licencia "estilo pit&oacute;n", que lo envolver&aacute; y asfixiar&aacute;, sino que est&aacute; protegido por la misma ley que le impide a Ud. fotocopiar un libro.</P></FONT></BODY>
</HTML>
